{
  "catalog": {
    "uuid": "ddc8ca6e-7ba4-4431-851d-daa2d498fce0",
    "metadata": {
      "title": "NIST SP 800-171A Revision 2 — Assessment Procedures for Security Requirements",
      "last-modified": "2025-11-13T00:00:00Z",
      "version": "2.0.5-oscal-clean",
      "oscal-version": "1.1.2",
      "remarks": "NIST SP 800-171A Rev 2 - Simplified format with required control statements. Each control includes a statement part (required by OSCAL schema) along with assessment objectives and guidance. Control statements are derived from control titles. This version is OSCAL-compliant with all non-standard properties removed.",
      "props": [
        {
          "name": "keywords",
          "value": "CUI, assessment, security assessment, assessment procedures, OSCAL"
        }
      ]
    },
    "groups": [
      {
        "id": "c-3.1",
        "title": "Access Control",
        "class": "family",
        "controls": [
          {
            "id": "c-3.1.1",
            "title": "Limit system access to authorized users, processes acting on behalf of authorized users, and devices",
            "parts": [
              {
                "name": "statement",
                "prose": "Limit system access to authorized users, processes acting on behalf of authorized users, and devices"
              },
              {
                "id": "c-3.1.1_obj.a",
                "name": "objective",
                "prose": "authorized users are identified."
              },
              {
                "id": "c-3.1.1_obj.b",
                "name": "objective",
                "prose": "processes acting on behalf of authorized users are identified."
              },
              {
                "id": "c-3.1.1_obj.c",
                "name": "objective",
                "prose": "devices (including other systems) authorized to connect to the system are identified."
              },
              {
                "id": "c-3.1.1_obj.d",
                "name": "objective",
                "prose": "system access is limited to authorized users."
              },
              {
                "id": "c-3.1.1_obj.e",
                "name": "objective",
                "prose": "system access is limited to processes acting on behalf of authorized users."
              },
              {
                "id": "c-3.1.1_obj.f",
                "name": "objective",
                "prose": "system access is limited to authorized devices (including other systems)."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Access control policy; procedures addressing account management; security plan; system design documentation; system configuration settings and associated documentation; list of active system accounts and the name of the individual associated with each account; list of conditions for group and role membership; notifications or records of recently transferred, separated, or terminated employees; list of recently disabled system accounts along with the name of the individual associated with each account; access authorization records; account management compliance reviews; system monitoring records; system audit logs and records; other relevant documents or records; list of devices and other systems authorized to connect to organizational systems].\n\n**INTERVIEW:** [SELECT FROM: Personnel with account management responsibilities; system or network administrators; personnel with information security responsibilities].\n\n**TEST:** [SELECT FROM: Organizational processes for managing system accounts; mechanisms for implementing account management]."
              }
            ]
          },
          {
            "id": "c-3.1.2",
            "title": "Limit system access to the types of transactions and functions that authorized users are permitted to execute.",
            "parts": [
              {
                "name": "statement",
                "prose": "Limit system access to the types of transactions and functions that authorized users are permitted to execute."
              },
              {
                "id": "c-3.1.2_obj.a",
                "name": "objective",
                "prose": "the types of transactions and functions that authorized users are permitted to execute are defined"
              },
              {
                "id": "c-3.1.2_obj.b",
                "name": "objective",
                "prose": "system access is limited to the defined types of transactions and functions for authorized users."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Access control policy; procedures addressing access enforcement; security plan; system design documentation; list of approved authorizations (user privileges) including remote access authorizations; system configuration settings and associated documentation; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with access enforcement responsibilities; system or network administrators; personnel with information security responsibilities; system developers].\n\n**TEST:** [SELECT FROM: Mechanisms implementing access control policy]."
              }
            ]
          },
          {
            "id": "c-3.1.3",
            "title": "Control the flow of CUI in accordance with approved authorizations.",
            "parts": [
              {
                "name": "statement",
                "prose": "Control the flow of CUI in accordance with approved authorizations."
              },
              {
                "id": "c-3.1.3_obj.a",
                "name": "objective",
                "prose": "information flow control policies are defined."
              },
              {
                "id": "c-3.1.3_obj.b",
                "name": "objective",
                "prose": "methods and enforcement mechanisms for controlling the flow of CUI are defined."
              },
              {
                "id": "c-3.1.3_obj.c",
                "name": "objective",
                "prose": "designated sources and destinations (e.g., networks, individuals, and devices) for CUI within systems and between interconnected systems are identified."
              },
              {
                "id": "c-3.1.3_obj.d",
                "name": "objective",
                "prose": "authorizations for controlling the flow of CUI are defined."
              },
              {
                "id": "c-3.1.3_obj.e",
                "name": "objective",
                "prose": "approved authorizations for controlling the flow of CUI are enforced."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Access control policy; information flow control policies; procedures addressing information flow enforcement; security plan; system design documentation; system configuration settings and associated documentation; list of information flow authorizations; system baseline configuration; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: System or network administrators; personnel with information security responsibilities; system developers].\n\n**TEST:** [SELECT FROM: Mechanisms implementing information flow enforcement policy]."
              }
            ]
          },
          {
            "id": "c-3.1.4",
            "title": "Separate the duties of individuals to reduce the risk of malevolent activity without collusion.",
            "parts": [
              {
                "name": "statement",
                "prose": "Separate the duties of individuals to reduce the risk of malevolent activity without collusion."
              },
              {
                "id": "c-3.1.4_obj.a",
                "name": "objective",
                "prose": "the duties of individuals requiring separation to reduce the risk of malevolent activity are defined."
              },
              {
                "id": "c-3.1.4_obj.b",
                "name": "objective",
                "prose": "organization-defined duties of individuals requiring separation are separated."
              },
              {
                "id": "c-3.1.4_obj.c",
                "name": "objective",
                "prose": "separate accounts for individuals whose duties and accesses must be separated to reduce the risk of malevolent activity or collusion are established"
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Access control policy; procedures addressing divisions of responsibility and separation of duties; security plan; system configuration settings and associated documentation; list of divisions of responsibility and separation of duties; system access authorizations; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with responsibilities for defining divisions of responsibility and separation of duties; personnel with information security responsibilities; system or network administrators].\n\n**TEST:** [SELECT FROM: Mechanisms implementing separation of duties policy]."
              }
            ]
          },
          {
            "id": "c-3.1.5",
            "title": "Employ the principle of least privilege, including for specific security functions and privileged accounts.",
            "parts": [
              {
                "name": "statement",
                "prose": "Employ the principle of least privilege, including for specific security functions and privileged accounts."
              },
              {
                "id": "c-3.1.5_obj.a",
                "name": "objective",
                "prose": "privileged accounts are identified."
              },
              {
                "id": "c-3.1.5_obj.b",
                "name": "objective",
                "prose": "access to privileged accounts is authorized in accordance with the principle of least privilege."
              },
              {
                "id": "c-3.1.5_obj.c",
                "name": "objective",
                "prose": "security functions are identified."
              },
              {
                "id": "c-3.1.5_obj.d",
                "name": "objective",
                "prose": "access to security functions is authorized in accordance with the principle of least privilege."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Access control policy; procedures addressing account management; security plan; system design documentation; system configuration settings and associated documentation; list of active system accounts and the name of the individual associated with each account; list of conditions for group and role membership; notifications or records of recently transferred, separated, or terminated employees; list of recently disabled system accounts along with the name of the individual associated with each account; access authorization records; account management compliance reviews; system monitoring/audit records; other relevant documents or records; procedures addressing least privilege; list of security functions (deployed in hardware, software, and firmware) and security-relevant information for which access must be explicitly authorized; list of system-generated privileged accounts; list of system administration personnel].\n\n**INTERVIEW:** [SELECT FROM: Personnel with account management responsibilities; system or network administrators; personnel with information security responsibilities; personnel with responsibilities for defining least privileges necessary to accomplish specified tasks].\n\n**TEST:** [SELECT FROM: Organizational processes for managing system accounts; mechanisms for implementing account management; mechanisms implementing least privilege functions; mechanisms prohibiting privileged access to the system]."
              }
            ]
          },
          {
            "id": "c-3.1.6",
            "title": "Use non-privileged accounts or roles when accessing nonsecurity functions.",
            "parts": [
              {
                "name": "statement",
                "prose": "Use non-privileged accounts or roles when accessing nonsecurity functions."
              },
              {
                "id": "c-3.1.6_obj.a",
                "name": "objective",
                "prose": "nonsecurity functions are identified."
              },
              {
                "id": "c-3.1.6_obj.b",
                "name": "objective",
                "prose": "users are required to use non-privileged accounts or roles when accessing nonsecurity functions."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Access control policy; procedures addressing least privilege; security plan; list of system-generated security functions assigned to system accounts or roles; system configuration settings and associated documentation; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with responsibilities for defining least privileges necessary to accomplish specified organizational tasks; personnel with information security responsibilities; system or network administrators].\n\n**TEST:** [SELECT FROM: Mechanisms implementing least privilege functions]."
              }
            ]
          },
          {
            "id": "c-3.1.7",
            "title": "Prevent non-privileged users from executing privileged functions and capture the execution of such functions in audit logs.",
            "parts": [
              {
                "name": "statement",
                "prose": "Prevent non-privileged users from executing privileged functions and capture the execution of such functions in audit logs."
              },
              {
                "id": "c-3.1.7_obj.a",
                "name": "objective",
                "prose": "privileged functions are defined."
              },
              {
                "id": "c-3.1.7_obj.b",
                "name": "objective",
                "prose": "non-privileged users are defined."
              },
              {
                "id": "c-3.1.7_obj.c",
                "name": "objective",
                "prose": "non-privileged users are prevented from executing privileged functions."
              },
              {
                "id": "c-3.1.7_obj.d",
                "name": "objective",
                "prose": "the execution of privileged functions is captured in audit logs."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Access control policy; procedures addressing least privilege; security plan; system design documentation; list of privileged functions and associated user account assignments; system configuration settings and associated documentation; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with responsibilities for defining least privileges necessary to accomplish specified tasks; personnel with information security responsibilities; system developers].\n\n**TEST:** [SELECT FROM: Mechanisms implementing least privilege functions for non-privileged users; mechanisms auditing the execution of privileged functions]."
              }
            ]
          },
          {
            "id": "c-3.1.8",
            "title": "Limit unsuccessful logon attempts.",
            "parts": [
              {
                "name": "statement",
                "prose": "Limit unsuccessful logon attempts."
              },
              {
                "id": "c-3.1.8_obj.a",
                "name": "objective",
                "prose": "the means of limiting unsuccessful logon attempts is defined."
              },
              {
                "id": "c-3.1.8_obj.b",
                "name": "objective",
                "prose": "the defined means of limiting unsuccessful logon attempts is implemented."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Access control policy; procedures addressing unsuccessful logon attempts; security plan; system design documentation; system configuration settings and associated documentation; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with information security responsibilities; system developers; system or network administrators].\n\n**TEST:** [SELECT FROM: Mechanisms implementing access control policy for unsuccessful logon attempts]."
              }
            ]
          },
          {
            "id": "c-3.1.9",
            "title": "Provide privacy and security notices consistent with applicable CUI rules.",
            "parts": [
              {
                "name": "statement",
                "prose": "Provide privacy and security notices consistent with applicable CUI rules."
              },
              {
                "id": "c-3.1.9_obj.a",
                "name": "objective",
                "prose": "privacy and security notices required by CUI-specified rules are identified, consistent, and associated with the specific CUI category"
              },
              {
                "id": "c-3.1.9_obj.b",
                "name": "objective",
                "prose": "privacy and security notices are displayed."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** SELECT FROM: Access control policy; privacy and security policies, procedures addressing system use notification; documented approval of system use notification messages or banners; system audit logs and records; system design documentation; user acknowledgements of notification message or banner; security plan; system use notification messages; system configuration settings and associated documentation; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: System or network administrators; personnel with information security responsibilities; personnel with responsibility for providing legal advice; system developers].\n\n**TEST:** [SELECT FROM: Mechanisms implementing system use notification]."
              }
            ]
          },
          {
            "id": "c-3.1.10",
            "title": "Use session lock with pattern-hiding displays to prevent access and viewing of data after a period of inactivity.",
            "parts": [
              {
                "name": "statement",
                "prose": "Use session lock with pattern-hiding displays to prevent access and viewing of data after a period of inactivity."
              },
              {
                "id": "c-3.1.10_obj.a",
                "name": "objective",
                "prose": "the period of inactivity after which the system initiates a session lock is defined."
              },
              {
                "id": "c-3.1.10_obj.b",
                "name": "objective",
                "prose": "access to the system and viewing of data is prevented by initiating a session lock after the defined period of inactivity."
              },
              {
                "id": "c-3.1.10_obj.c",
                "name": "objective",
                "prose": "previously visible information is concealed via a pattern-hiding display after the defined period of inactivity."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Access control policy; procedures addressing session lock; procedures addressing identification and authentication; system design documentation; system configuration settings and associated documentation; security plan; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: System or network administrators; personnel with information security responsibilities; system developers].\n\n**TEST:** [SELECT FROM: Mechanisms implementing access control policy for session lock]."
              }
            ]
          },
          {
            "id": "c-3.1.11",
            "title": "Terminate automatically a user session after a defined condition. ",
            "parts": [
              {
                "name": "statement",
                "prose": "Terminate automatically a user session after a defined condition. "
              },
              {
                "id": "c-3.1.11_obj.a",
                "name": "objective",
                "prose": "conditions requiring a user session to terminate are defined."
              },
              {
                "id": "c-3.1.11_obj.b",
                "name": "objective",
                "prose": "a user session is automatically terminated after any of the defined conditions occur."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Access control policy; procedures addressing session termination; system design documentation; security plan; system configuration settings and associated documentation; list of conditions or trigger events requiring session disconnect; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: System or network administrators; personnel with information security responsibilities; system developers].\n\n**TEST:** [SELECT FROM: Mechanisms implementing user session termination]."
              }
            ]
          },
          {
            "id": "c-3.1.12",
            "title": "Monitor and control remote access sessions.",
            "parts": [
              {
                "name": "statement",
                "prose": "Monitor and control remote access sessions."
              },
              {
                "id": "c-3.1.12_obj.a",
                "name": "objective",
                "prose": "remote access sessions are permitted."
              },
              {
                "id": "c-3.1.12_obj.b",
                "name": "objective",
                "prose": "the types of permitted remote access are identified."
              },
              {
                "id": "c-3.1.12_obj.c",
                "name": "objective",
                "prose": "remote access sessions are controlled."
              },
              {
                "id": "c-3.1.12_obj.d",
                "name": "objective",
                "prose": "remote access sessions are monitored."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Access control policy; procedures addressing remote access implementation and usage (including restrictions); configuration management plan; security plan; system configuration settings and associated documentation; remote access authorizations; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with responsibilities for managing remote access connections; system or network administrators; personnel with information security responsibilities].\n\n**TEST:** [SELECT FROM: Remote access management capability for the system]."
              }
            ]
          },
          {
            "id": "c-3.1.13",
            "title": "Employ cryptographic mechanisms to protect the confidentiality of remote access sessions.",
            "parts": [
              {
                "name": "statement",
                "prose": "Employ cryptographic mechanisms to protect the confidentiality of remote access sessions."
              },
              {
                "id": "c-3.1.13_obj.a",
                "name": "objective",
                "prose": "cryptographic mechanisms to protect the confidentiality of remote access sessions are identified."
              },
              {
                "id": "c-3.1.13_obj.b",
                "name": "objective",
                "prose": "cryptographic mechanisms to protect the confidentiality of remote access sessions are implemented."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Access control policy; procedures addressing remote access to the system; security plan; system design documentation; system configuration settings and associated documentation; cryptographic mechanisms and associated configuration documentation; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: System or network administrators; personnel with information security responsibilities; system developers].\n\n**TEST:** [SELECT FROM: Cryptographic mechanisms protecting remote access sessions]."
              }
            ]
          },
          {
            "id": "c-3.1.14",
            "title": "Route remote access via managed access control points.",
            "parts": [
              {
                "name": "statement",
                "prose": "Route remote access via managed access control points."
              },
              {
                "id": "c-3.1.14_obj.a",
                "name": "objective",
                "prose": "managed access control points are identified and implemented."
              },
              {
                "id": "c-3.1.14_obj.b",
                "name": "objective",
                "prose": "remote access is routed through managed network access control points."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Access control policy; procedures addressing remote access to the system; security plan; system design documentation; list of all managed network access control points; system configuration settings and associated documentation; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: System or network administrators; personnel with information security responsibilities].\n\n**TEST:** [SELECT FROM: Mechanisms routing all remote accesses through managed network access control points]."
              }
            ]
          },
          {
            "id": "c-3.1.15",
            "title": "Authorize remote execution of privileged commands and remote access to security-relevant information.",
            "parts": [
              {
                "name": "statement",
                "prose": "Authorize remote execution of privileged commands and remote access to security-relevant information."
              },
              {
                "id": "c-3.1.15_obj.a",
                "name": "objective",
                "prose": "privileged commands authorized for remote execution are identified."
              },
              {
                "id": "c-3.1.15_obj.b",
                "name": "objective",
                "prose": "security-relevant information authorized to be accessed remotely is identified."
              },
              {
                "id": "c-3.1.15_obj.c",
                "name": "objective",
                "prose": "the execution of the identified privileged commands via remote access is authorized."
              },
              {
                "id": "c-3.1.15_obj.d",
                "name": "objective",
                "prose": "access to the identified security-relevant information via remote access is authorized."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Access control policy; procedures addressing remote access to the system; system configuration settings and associated documentation; security plan; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: System or network administrators; personnel with information security responsibilities].\n\n**TEST:** [SELECT FROM: Mechanisms implementing remote access management]."
              }
            ]
          },
          {
            "id": "c-3.1.16",
            "title": "Authorize wireless access prior to allowing such connections.",
            "parts": [
              {
                "name": "statement",
                "prose": "Authorize wireless access prior to allowing such connections."
              },
              {
                "id": "c-3.1.16_obj.a",
                "name": "objective",
                "prose": "wireless access points are identified."
              },
              {
                "id": "c-3.1.16_obj.b",
                "name": "objective",
                "prose": "wireless access is authorized prior to allowing such connections."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Access control policy; configuration management plan; procedures addressing wireless access implementation and usage (including restrictions); security plan; system design documentation; system configuration settings and associated documentation; wireless access authorizations; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with responsibilities for managing wireless access connections; personnel with information security responsibilities].\n\n**TEST:** [SELECT FROM: Wireless access management capability for the system]."
              }
            ]
          },
          {
            "id": "c-3.1.17",
            "title": "Protect wireless access using authentication and encryption.",
            "parts": [
              {
                "name": "statement",
                "prose": "Protect wireless access using authentication and encryption."
              },
              {
                "id": "c-3.1.17_obj.a",
                "name": "objective",
                "prose": "wireless access to the system is protected using encryption."
              },
              {
                "id": "c-3.1.17_obj.b",
                "name": "objective",
                "prose": "wireless access to the system is protected using authentication."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Access control policy; system design documentation; procedures addressing wireless implementation and usage (including restrictions); security plan; system configuration settings and associated documentation; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: System or network administrators; personnel with information security responsibilities; system developers].\n\n**TEST:** [SELECT FROM: Mechanisms implementing wireless access protections to the system]."
              }
            ]
          },
          {
            "id": "c-3.1.18",
            "title": "Control connection of mobile devices.",
            "parts": [
              {
                "name": "statement",
                "prose": "Control connection of mobile devices."
              },
              {
                "id": "c-3.1.18_obj.a",
                "name": "objective",
                "prose": "mobile devices that process, store, or transmit CUI are identified."
              },
              {
                "id": "c-3.1.18_obj.b",
                "name": "objective",
                "prose": "the connection of mobile devices is authorized."
              },
              {
                "id": "c-3.1.18_obj.c",
                "name": "objective",
                "prose": "mobile device connections are monitored and logged."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Access control policy; authorizations for mobile device connections to organizational systems; procedures addressing access control for mobile device usage (including restrictions); system design documentation; configuration management plan; security plan; system audit logs and records; system configuration settings and associated documentation; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel using mobile devices to access organizational systems; system or network administrators; personnel with information security responsibilities].\n\n**TEST:** [SELECT FROM: Access control capability authorizing mobile device connections to organizational systems]."
              }
            ]
          },
          {
            "id": "c-3.1.19",
            "title": "Encrypt CUI on mobile devices and mobile computing platforms.",
            "parts": [
              {
                "name": "statement",
                "prose": "Encrypt CUI on mobile devices and mobile computing platforms."
              },
              {
                "id": "c-3.1.19_obj.a",
                "name": "objective",
                "prose": "mobile devices and mobile computing platforms that process, store, or transmit CUI are identified."
              },
              {
                "id": "c-3.1.19_obj.b",
                "name": "objective",
                "prose": "encryption is employed to protect CUI on identified mobile devices and mobile computing platforms."
              }
            ]
          },
          {
            "id": "c-3.1.20",
            "title": "Verify and control/limit connections to and use of external systems.",
            "parts": [
              {
                "name": "statement",
                "prose": "Verify and control/limit connections to and use of external systems."
              },
              {
                "id": "c-3.1.20_obj.a",
                "name": "objective",
                "prose": "connections to external systems are identified."
              },
              {
                "id": "c-3.1.20_obj.b",
                "name": "objective",
                "prose": "use of external systems is identified."
              },
              {
                "id": "c-3.1.20_obj.c",
                "name": "objective",
                "prose": "connections to external systems are verified."
              },
              {
                "id": "c-3.1.20_obj.d",
                "name": "objective",
                "prose": "use of external systems is verified."
              },
              {
                "id": "c-3.1.20_obj.e",
                "name": "objective",
                "prose": "connections to external systems are controlled/limited."
              },
              {
                "id": "c-3.1.20_obj.f",
                "name": "objective",
                "prose": "use of external systems is controlled/limited."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Access control policy; procedures addressing the use of external systems; terms and conditions for external systems; security plan; list of types of applications accessible from external systems; system configuration settings and associated documentation; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with responsibilities for defining terms and conditions for use of external systems to access organizational systems; system or network administrators; personnel with information security responsibilities].\n\n**TEST:** [SELECT FROM: Mechanisms implementing terms and conditions on use of external systems]."
              }
            ]
          },
          {
            "id": "c-3.1.21",
            "title": "Limit use of organizational portable storage devices on external systems.",
            "parts": [
              {
                "name": "statement",
                "prose": "Limit use of organizational portable storage devices on external systems."
              },
              {
                "id": "c-3.1.21_obj.a",
                "name": "objective",
                "prose": "use of organizational portable storage devices containing CUI on external systems is identified and documented."
              },
              {
                "id": "c-3.1.21_obj.b",
                "name": "objective",
                "prose": "limits on the use of organizational portable storage devices containing CUI on external systems are defined."
              },
              {
                "id": "c-3.1.21_obj.c",
                "name": "objective",
                "prose": "use of organizational portable storage devices containing CUI on external systems is limited as defined."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Access control policy; procedures addressing the use of external systems; security plan; system configuration settings and associated documentation; system connection or processing agreements; account management documents; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with responsibilities for restricting or prohibiting use of organization-controlled storage devices on external systems; system or network administrators; personnel with information security responsibilities].\n\n**TEST:** [SELECT FROM: Mechanisms implementing restrictions on use of portable storage devices]."
              }
            ]
          },
          {
            "id": "c-3.1.22",
            "title": "Control CUI posted or processed on publicly accessible systems.",
            "parts": [
              {
                "name": "statement",
                "prose": "Control CUI posted or processed on publicly accessible systems."
              },
              {
                "id": "c-3.1.22_obj.a",
                "name": "objective",
                "prose": "individuals authorized to post or process information on publicly accessible systems are identified."
              },
              {
                "id": "c-3.1.22_obj.b",
                "name": "objective",
                "prose": "procedures to ensure CUI is not posted or processed on publicly accessible systems are identified."
              },
              {
                "id": "c-3.1.22_obj.c",
                "name": "objective",
                "prose": "a review process in in place prior to posting of any content to publicly accessible systems."
              },
              {
                "id": "c-3.1.22_obj.d",
                "name": "objective",
                "prose": "content on publicly accessible information systems is reviewed to ensure that it does not include CUI."
              },
              {
                "id": "c-3.1.22_obj.e",
                "name": "objective",
                "prose": "mechanisms are in place to remove and address improper posting of CUI."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Access control policy; procedures addressing publicly accessible content; security plan; list of users authorized to post publicly accessible content on organizational systems; training materials and/or records; records of publicly accessible information reviews; records of response to nonpublic information on public websites; system audit logs and records; security awareness training records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with responsibilities for managing publicly accessible information posted on organizational systems; personnel with information security responsibilities].\n\n**TEST:** [SELECT FROM: Mechanisms implementing management of publicly accessible content]."
              }
            ]
          }
        ]
      },
      {
        "id": "c-3.2",
        "title": "Awareness and Training",
        "class": "family",
        "controls": [
          {
            "id": "c-3.2.1",
            "title": "Ensure that managers, systems administrators, and users of organizational systems are made aware of the security risks associated with their activities and of the applicable policies, standards, and procedures related to the security of those systems.",
            "parts": [
              {
                "name": "statement",
                "prose": "Ensure that managers, systems administrators, and users of organizational systems are made aware of the security risks associated with their activities and of the applicable policies, standards, and procedures related to the security of those systems."
              },
              {
                "id": "c-3.2.1_obj.a",
                "name": "objective",
                "prose": "security risks associated with organizational activities involving CUI are identified."
              },
              {
                "id": "c-3.2.1_obj.b",
                "name": "objective",
                "prose": "policies, standards, and procedures related to the security of the system are identified."
              },
              {
                "id": "c-3.2.1_obj.c",
                "name": "objective",
                "prose": "managers, systems administrators, and users of the system are made aware of the security risks associated with their activities."
              },
              {
                "id": "c-3.2.1_obj.d",
                "name": "objective",
                "prose": "managers, systems administrators, and users of the system are made aware of the applicable policies, standards, and procedures related to the security of the system."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Security awareness and training policy; procedures addressing security awareness training implementation; relevant codes of federal regulations; security awareness training curriculum; security awareness training materials; security plan; training records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with responsibilities for security awareness training; personnel with information security responsibilities; personnel composing the general system user community].\n\n**TEST:** [SELECT FROM: Mechanisms managing security awareness training; mechanisms managing role-based security training]."
              }
            ]
          },
          {
            "id": "c-3.2.2",
            "title": "Ensure that organizational personnel are adequately trained to carry out their assigned information security-related duties and responsibilities.",
            "parts": [
              {
                "name": "statement",
                "prose": "Ensure that organizational personnel are adequately trained to carry out their assigned information security-related duties and responsibilities."
              },
              {
                "id": "c-3.2.2_obj.a",
                "name": "objective",
                "prose": "information security-related duties, roles, and responsibilities are defined."
              },
              {
                "id": "c-3.2.2_obj.b",
                "name": "objective",
                "prose": "information security-related duties, roles, and responsibilities are assigned to designated personnel."
              },
              {
                "id": "c-3.2.2_obj.c",
                "name": "objective",
                "prose": "personnel are adequately trained to carry out their assigned information security-related duties, roles, and responsibilities."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Security awareness and training policy; procedures addressing security training implementation; codes of federal regulations; security training curriculum; security training materials; security plan; training records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with responsibilities for role-based security training; personnel with assigned system security roles and responsibilities].\n\n**TEST:** [SELECT FROM: Mechanisms managing role-based security training]."
              }
            ]
          },
          {
            "id": "c-3.2.3",
            "title": "Provide security awareness training on recognizing and reporting potential indicators of insider threat.",
            "parts": [
              {
                "name": "statement",
                "prose": "Provide security awareness training on recognizing and reporting potential indicators of insider threat."
              },
              {
                "id": "c-3.2.3_obj.a",
                "name": "objective",
                "prose": "potential indicators associated with insider threats are identified."
              },
              {
                "id": "c-3.2.3_obj.b",
                "name": "objective",
                "prose": "security awareness training on recognizing and reporting potential indicators of insider threat is provided to managers and employees."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Security awareness and training policy; procedures addressing security awareness training implementation; security awareness training curriculum; security awareness training materials; insider threat policy and procedures; security plan; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel that participate in security awareness training; personnel with responsibilities for basic security awareness training; personnel with information security responsibilities].\n\n**TEST:** [SELECT FROM: Mechanisms managing insider threat training]."
              }
            ]
          }
        ]
      },
      {
        "id": "c-3.3",
        "title": "Audit and Accountability",
        "class": "family",
        "controls": [
          {
            "id": "c-3.3.1",
            "title": "Create and retain system audit logs and records to the extent needed to enable the monitoring, analysis, investigation, and reporting of unlawful or unauthorized system activity.",
            "parts": [
              {
                "name": "statement",
                "prose": "Create and retain system audit logs and records to the extent needed to enable the monitoring, analysis, investigation, and reporting of unlawful or unauthorized system activity."
              },
              {
                "id": "c-3.3.1_obj.a",
                "name": "objective",
                "prose": "audit logs needed (i.e., event types to be logged) to enable the monitoring, analysis, investigation, and reporting of unlawful or unauthorized system activity are specified."
              },
              {
                "id": "c-3.3.1_obj.b",
                "name": "objective",
                "prose": "the content of audit records needed to support monitoring, analysis, investigation, and reporting of unlawful or unauthorized system activity is defined."
              },
              {
                "id": "c-3.3.1_obj.c",
                "name": "objective",
                "prose": "audit records are created (generated)."
              },
              {
                "id": "c-3.3.1_obj.d",
                "name": "objective",
                "prose": "audit records, once created, contain the defined content."
              },
              {
                "id": "c-3.3.1_obj.e",
                "name": "objective",
                "prose": "retention requirements for audit records are defined."
              },
              {
                "id": "c-3.3.1_obj.f",
                "name": "objective",
                "prose": "audit records are retained as defined."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Audit and accountability policy; procedures addressing auditable events; security plan; system design documentation; system configuration settings and associated documentation; system audit logs and records; system auditable events; system incident reports; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with audit and accountability responsibilities; personnel with information security responsibilities; system or network administrators].\n\n**TEST:** [SELECT FROM: Mechanisms implementing system audit logging]."
              }
            ]
          },
          {
            "id": "c-3.3.2",
            "title": "Ensure that the actions of individual system users can be uniquely traced to those users so they can be held accountable for their actions.",
            "parts": [
              {
                "name": "statement",
                "prose": "Ensure that the actions of individual system users can be uniquely traced to those users so they can be held accountable for their actions."
              },
              {
                "id": "c-3.3.2_obj.a",
                "name": "objective",
                "prose": "the content of the audit records needed to support the ability to uniquely trace users to their actions is defined."
              },
              {
                "id": "c-3.3.2_obj.b",
                "name": "objective",
                "prose": "audit records, once created, contain the defined content."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Audit and accountability policy; procedures addressing audit records and event types; security plan; system design documentation; system configuration settings and associated documentation; system audit logs and records; system events; system incident reports; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with audit and accountability responsibilities; personnel with information security responsibilities; system or network administrators].\n\n**TEST:** [SELECT FROM: Mechanisms implementing system audit logging]."
              }
            ]
          },
          {
            "id": "c-3.3.3",
            "title": "Review and update logged events.",
            "parts": [
              {
                "name": "statement",
                "prose": "Review and update logged events."
              },
              {
                "id": "c-3.3.3_obj.a",
                "name": "objective",
                "prose": "a process for determining when to review logged events is defined."
              },
              {
                "id": "c-3.3.3_obj.b",
                "name": "objective",
                "prose": "event types being logged are reviewed in accordance with the defined review process."
              },
              {
                "id": "c-3.3.3_obj.c",
                "name": "objective",
                "prose": "event types being logged are updated based on the review."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Audit and accountability policy; procedures addressing audit records and event types; security plan; list of organization-defined event types to be logged; reviewed and updated records of logged event types; system audit logs and records; system incident reports; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with audit and accountability responsibilities; personnel with information security responsibilities].\n\n**TEST:** [SELECT FROM: Mechanisms supporting review and update of logged event types]."
              }
            ]
          },
          {
            "id": "c-3.3.4",
            "title": "Alert in the event of an audit logging process failure.",
            "parts": [
              {
                "name": "statement",
                "prose": "Alert in the event of an audit logging process failure."
              },
              {
                "id": "c-3.3.4_obj.a",
                "name": "objective",
                "prose": "personnel or roles to be alerted in the event of an audit logging process failure are identified."
              },
              {
                "id": "c-3.3.4_obj.b",
                "name": "objective",
                "prose": "types of audit logging process failures for which alert will be generated are defined."
              },
              {
                "id": "c-3.3.4_obj.c",
                "name": "objective",
                "prose": "identified personnel or roles are alerted in the event of an audit logging process failure."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Audit and accountability policy; procedures addressing response to audit logging processing failures; system design documentation; security plan; system configuration settings and associated documentation; list of personnel to be notified in case of an audit logging processing failure; system incident reports; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with audit and accountability responsibilities; personnel with information security responsibilities; system or network administrators; system developers].\n\n**TEST:** [SELECT FROM: Mechanisms implementing system response to audit logging processing failures]."
              }
            ]
          },
          {
            "id": "c-3.3.5",
            "title": "Correlate audit record review, analysis, and reporting processes for investigation and response to indications of unlawful, unauthorized, suspicious, or unusual activity.",
            "parts": [
              {
                "name": "statement",
                "prose": "Correlate audit record review, analysis, and reporting processes for investigation and response to indications of unlawful, unauthorized, suspicious, or unusual activity."
              },
              {
                "id": "c-3.3.5_obj.a",
                "name": "objective",
                "prose": "audit record review, analysis, and reporting processes for investigation and response to indications of unlawful, unauthorized, suspicious, or unusual activity are defined."
              },
              {
                "id": "c-3.3.5_obj.b",
                "name": "objective",
                "prose": "defined audit record review, analysis, and reporting processes are correlated."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Audit and accountability policy; procedures addressing audit record review, analysis, and reporting; security plan; system design documentation; system configuration settings and associated documentation; system audit logs and records across different repositories; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with audit record review, analysis, and reporting responsibilities; personnel with information security responsibilities].\n\n**TEST:** : [SELECT FROM: Mechanisms supporting analysis and correlation of audit records]."
              }
            ]
          },
          {
            "id": "c-3.3.6",
            "title": "Provide audit record reduction and report generation to support on-demand analysis and reporting.",
            "parts": [
              {
                "name": "statement",
                "prose": "Provide audit record reduction and report generation to support on-demand analysis and reporting."
              },
              {
                "id": "c-3.3.6_obj.a",
                "name": "objective",
                "prose": "an audit record reduction capability that supports on-demand analysis is provided."
              },
              {
                "id": "c-3.3.6_obj.b",
                "name": "objective",
                "prose": "a report generation capability that supports on-demand reporting is provided."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Audit and accountability policy; procedures addressing audit record reduction and report generation; system design documentation; security plan; system configuration settings and associated documentation; audit record reduction, review, analysis, and reporting tools; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with audit record reduction and report generation responsibilities; personnel with information security responsibilities].\n\n**TEST:** [SELECT FROM: Audit record reduction and report generation capability]."
              }
            ]
          },
          {
            "id": "c-3.3.7",
            "title": "Provide a system capability that compares and synchronizes internal system clocks with an authoritative source to generate time stamps for audit records.",
            "parts": [
              {
                "name": "statement",
                "prose": "Provide a system capability that compares and synchronizes internal system clocks with an authoritative source to generate time stamps for audit records."
              },
              {
                "id": "c-3.3.7_obj.a",
                "name": "objective",
                "prose": "internal system clocks are used to generate time stamps for audit records."
              },
              {
                "id": "c-3.3.7_obj.b",
                "name": "objective",
                "prose": "an authoritative source with which to compare and synchronize internal system clocks is specified."
              },
              {
                "id": "c-3.3.7_obj.c",
                "name": "objective",
                "prose": "internal system clocks used to generate time stamps for audit records are compared to and synchronized with the specified authoritative time source."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Audit and accountability policy; procedures addressing time stamp generation; system design documentation; security plan; system configuration settings and associated documentation; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with information security responsibilities; system or network administrators; system developers].\n\n**TEST:** [SELECT FROM: Mechanisms implementing time stamp generation]."
              }
            ]
          },
          {
            "id": "c-3.3.8",
            "title": "Protect audit information and audit logging tools from unauthorized access, modification, and deletion.",
            "parts": [
              {
                "name": "statement",
                "prose": "Protect audit information and audit logging tools from unauthorized access, modification, and deletion."
              },
              {
                "id": "c-3.3.8_obj.a",
                "name": "objective",
                "prose": "audit information is protected from unauthorized access."
              },
              {
                "id": "c-3.3.8_obj.b",
                "name": "objective",
                "prose": "audit information is protected from unauthorized modification."
              },
              {
                "id": "c-3.3.8_obj.c",
                "name": "objective",
                "prose": "audit information is protected from unauthorized deletion."
              },
              {
                "id": "c-3.3.8_obj.d",
                "name": "objective",
                "prose": "audit logging tools are protected from unauthorized access."
              },
              {
                "id": "c-3.3.8_obj.e",
                "name": "objective",
                "prose": "audit logging tools are protected from unauthorized modification."
              },
              {
                "id": "c-3.3.8_obj.f",
                "name": "objective",
                "prose": "audit logging tools are protected from unauthorized deletion."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Audit and accountability policy; access control policy and procedures; procedures addressing protection of audit information; security plan; system design documentation; system configuration settings and associated documentation, system audit logs and records; audit logging tools; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with audit and accountability responsibilities; personnel with information security responsibilities; system or network administrators; system developers].\n\n**TEST:** [SELECT FROM: Mechanisms implementing audit information protection]."
              }
            ]
          },
          {
            "id": "c-3.3.9",
            "title": "Limit management of audit logging functionality to a subset of privileged users.",
            "parts": [
              {
                "name": "statement",
                "prose": "Limit management of audit logging functionality to a subset of privileged users."
              },
              {
                "id": "c-3.3.9_obj.a",
                "name": "objective",
                "prose": "a subset of privileged users granted access to manage audit logging functionality is defined."
              },
              {
                "id": "c-3.3.9_obj.b",
                "name": "objective",
                "prose": "management of audit logging functionality is limited to the defined subset of privileged users."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Audit and accountability policy; access control policy and procedures; procedures addressing protection of audit information; security plan; system design documentation; system configuration settings and associated documentation; access authorizations; system-generated list of privileged users with access to management of audit logging functionality; access control list; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with audit and accountability responsibilities; personnel with information security responsibilities; system or network administrators; system developers].\n\n**TEST:** [SELECT FROM: Mechanisms managing access to audit logging functionality]."
              }
            ]
          }
        ]
      },
      {
        "id": "c-3.4",
        "title": "Configuration Management",
        "class": "family",
        "controls": [
          {
            "id": "c-3.4.1",
            "title": "Establish and maintain baseline configurations and inventories of organizational systems",
            "parts": [
              {
                "name": "statement",
                "prose": "Establish and maintain baseline configurations and inventories of organizational systems"
              },
              {
                "id": "c-3.4.1_obj.a",
                "name": "objective",
                "prose": "a baseline configuration is established."
              },
              {
                "id": "c-3.4.1_obj.b",
                "name": "objective",
                "prose": "the baseline configuration includes hardware, software, firmware, and documentation."
              },
              {
                "id": "c-3.4.1_obj.c",
                "name": "objective",
                "prose": "the baseline configuration is maintained (reviewed and updated) throughout the system development life cycle."
              },
              {
                "id": "c-3.4.1_obj.d",
                "name": "objective",
                "prose": "a system inventory is established."
              },
              {
                "id": "c-3.4.1_obj.e",
                "name": "objective",
                "prose": "the system inventory includes hardware, software, firmware, and documentation."
              },
              {
                "id": "c-3.4.1_obj.f",
                "name": "objective",
                "prose": "the inventory is maintained (reviewed and updated) throughout the system development life cycle."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Configuration management policy; procedures addressing the baseline configuration of the system; procedures addressing system inventory; security plan; configuration management plan; system inventory records; inventory review and update records; enterprise architecture documentation; system design documentation; system architecture and configuration documentation; system configuration settings and associated documentation; change control records; system component installation records; system component removal records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with configuration management responsibilities; personnel with responsibilities for establishing the system inventory; personnel with responsibilities for updating the system inventory; personnel with information security responsibilities; system or network administrators].\n\n**TEST:** [SELECT FROM: Organizational processes for managing baseline configurations; mechanisms supporting configuration control of the baseline configuration; organizational processes for developing and documenting an inventory of system components; organizational processes for updating inventory of system components; mechanisms supporting or implementing the system inventory; mechanisms implementing updating of the system inventory]."
              }
            ]
          },
          {
            "id": "c-3.4.2",
            "title": "Establish and enforce security configuration settings for information technology products employed in organizational systems.",
            "parts": [
              {
                "name": "statement",
                "prose": "Establish and enforce security configuration settings for information technology products employed in organizational systems."
              },
              {
                "id": "c-3.4.2_obj.a",
                "name": "objective",
                "prose": "security configuration settings for information technology products employed in the system are established and included in the baseline configuration."
              },
              {
                "id": "c-3.4.2_obj.b",
                "name": "objective",
                "prose": "security configuration settings for information technology products employed in the system are enforced."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Configuration management policy; procedures addressing configuration settings for the system; configuration management plan; security plan; system design documentation; system configuration settings and associated documentation; security configuration checklists; evidence supporting approved deviations from established configuration settings; change control records; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with security configuration management responsibilities; personnel with information security responsibilities; system or network administrators].\n\n**TEST:** [SELECT FROM: Organizational processes for managing configuration settings; mechanisms that implement, monitor, and/or control system configuration settings; mechanisms that identify and/or document deviations from established configuration settings]."
              }
            ]
          },
          {
            "id": "c-3.4.3",
            "title": "Track, review, approve or disapprove, and log changes to organizational systems.",
            "parts": [
              {
                "name": "statement",
                "prose": "Track, review, approve or disapprove, and log changes to organizational systems."
              },
              {
                "id": "c-3.4.3_obj.a",
                "name": "objective",
                "prose": "changes to the system are tracked."
              },
              {
                "id": "c-3.4.3_obj.b",
                "name": "objective",
                "prose": "changes to the system are reviewed."
              },
              {
                "id": "c-3.4.3_obj.c",
                "name": "objective",
                "prose": "changes to the system are approved or disapproved."
              },
              {
                "id": "c-3.4.3_obj.d",
                "name": "objective",
                "prose": "changes to the system are logged."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Configuration management policy; procedures addressing system configuration change control; configuration management plan; system architecture and configuration documentation; security plan; change control records; system audit logs and records; change control audit and review reports; agenda/minutes from configuration change control oversight meetings; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with configuration change control responsibilities; personnel with information security responsibilities; system or network administrators; members of change control board or similar].\n\n**TEST:** [SELECT FROM: Organizational processes for configuration change control; mechanisms that implement configuration change control]."
              }
            ]
          },
          {
            "id": "c-3.4.4",
            "title": "Analyze the security impact of changes prior to implementation.",
            "parts": [
              {
                "name": "statement",
                "prose": "Analyze the security impact of changes prior to implementation."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Configuration management policy; procedures addressing security impact analysis for changes to the system; configuration management plan; security impact analysis documentation; security plan; analysis tools and associated outputs; change control records; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with responsibility for conducting security impact analysis; personnel with information security responsibilities; system or network administrators].\n\n**TEST:** [SELECT FROM: Organizational processes for security impact analysis]."
              }
            ]
          },
          {
            "id": "c-3.4.5",
            "title": "Define, document, approve, and enforce physical and logical access restrictions associated with changes to organizational systems.",
            "parts": [
              {
                "name": "statement",
                "prose": "Define, document, approve, and enforce physical and logical access restrictions associated with changes to organizational systems."
              },
              {
                "id": "c-3.4.5_obj.a",
                "name": "objective",
                "prose": "physical access restrictions associated with changes to the system are defined."
              },
              {
                "id": "c-3.4.5_obj.b",
                "name": "objective",
                "prose": "physical access restrictions associated with changes to the system are documented."
              },
              {
                "id": "c-3.4.5_obj.c",
                "name": "objective",
                "prose": "physical access restrictions associated with changes to the system are approved."
              },
              {
                "id": "c-3.4.5_obj.d",
                "name": "objective",
                "prose": "physical access restrictions associated with changes to the system are enforced."
              },
              {
                "id": "c-3.4.5_obj.e",
                "name": "objective",
                "prose": "logical access restrictions associated with changes to the system are defined."
              },
              {
                "id": "c-3.4.5_obj.f",
                "name": "objective",
                "prose": "logical access restrictions associated with changes to the system are documented."
              },
              {
                "id": "c-3.4.5_obj.g",
                "name": "objective",
                "prose": "logical access restrictions associated with changes to the system are approved."
              },
              {
                "id": "c-3.4.5_obj.h",
                "name": "objective",
                "prose": "logical access restrictions associated with changes to the system are enforced."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Configuration management policy; procedures addressing access restrictions for changes to the system; security plan; configuration management plan; system design documentation; system architecture and configuration documentation; system configuration settings and associated documentation; logical access approvals; physical access approvals; access credentials; change control records; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with logical access control responsibilities; personnel with physical access control responsibilities; personnel with information security responsibilities; system or network administrators].\n\n**TEST:** [SELECT FROM: Organizational processes for managing access restrictions associated with changes to the system; mechanisms supporting, implementing, and enforcing access restrictions associated with changes to the system]."
              }
            ]
          },
          {
            "id": "c-3.4.6",
            "title": "Employ the principle of least functionality by configuring organizational systems to provide only essential capabilities.",
            "parts": [
              {
                "name": "statement",
                "prose": "Employ the principle of least functionality by configuring organizational systems to provide only essential capabilities."
              },
              {
                "id": "c-3.4.6_obj.a",
                "name": "objective",
                "prose": "essential system capabilities are defined based on the principle of least functionality."
              },
              {
                "id": "c-3.4.6_obj.b",
                "name": "objective",
                "prose": "the system is configured to provide only the defined essential capabilities."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Configuration management policy; configuration management plan; procedures addressing least functionality in the system; security plan; system design documentation; system configuration settings and associated documentation; security configuration checklists; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with security configuration management responsibilities; personnel with information security responsibilities; system or network administrators].\n\n**TEST:** [SELECT FROM: Organizational processes prohibiting or restricting functions, ports, protocols, or services; mechanisms implementing restrictions or prohibition of functions, ports, protocols, or services]."
              }
            ]
          },
          {
            "id": "c-3.4.7",
            "title": "Restrict, disable, or prevent the use of nonessential programs, functions, ports, protocols, and services.",
            "parts": [
              {
                "name": "statement",
                "prose": "Restrict, disable, or prevent the use of nonessential programs, functions, ports, protocols, and services."
              },
              {
                "id": "c-3.4.7_obj.a",
                "name": "objective",
                "prose": "essential programs are defined."
              },
              {
                "id": "c-3.4.7_obj.b",
                "name": "objective",
                "prose": "the use of nonessential programs is defined."
              },
              {
                "id": "c-3.4.7_obj.c",
                "name": "objective",
                "prose": "the use of nonessential programs is restricted, disabled, or prevented as defined."
              },
              {
                "id": "c-3.4.7_obj.d",
                "name": "objective",
                "prose": "essential functions are defined."
              },
              {
                "id": "c-3.4.7_obj.e",
                "name": "objective",
                "prose": "the use of nonessential functions is defined."
              },
              {
                "id": "c-3.4.7_obj.f",
                "name": "objective",
                "prose": "the use of nonessential functions is restricted, disabled, or prevented as defined."
              },
              {
                "id": "c-3.4.7_obj.g",
                "name": "objective",
                "prose": "essential ports are defined."
              },
              {
                "id": "c-3.4.7_obj.h",
                "name": "objective",
                "prose": "the use of nonessential ports is defined."
              },
              {
                "id": "c-3.4.7_obj.i",
                "name": "objective",
                "prose": "the use of nonessential ports is restricted, disabled, or prevented as defined."
              },
              {
                "id": "c-3.4.7_obj.j",
                "name": "objective",
                "prose": "essential protocols are defined."
              },
              {
                "id": "c-3.4.7_obj.k",
                "name": "objective",
                "prose": "the use of nonessential protocols is defined."
              },
              {
                "id": "c-3.4.7_obj.l",
                "name": "objective",
                "prose": "the use of nonessential protocols is restricted, disabled, or prevented as defined."
              },
              {
                "id": "c-3.4.7_obj.m",
                "name": "objective",
                "prose": "essential services are defined."
              },
              {
                "id": "c-3.4.7_obj.n",
                "name": "objective",
                "prose": "the use of nonessential services is defined."
              },
              {
                "id": "c-3.4.7_obj.o",
                "name": "objective",
                "prose": "the use of nonessential services is restricted, disabled, or prevented as defined."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Configuration management policy; procedures addressing least functionality in the system; configuration management plan; security plan; system design documentation; system configuration settings and associated documentation; specifications for preventing software program execution; security configuration checklists; documented reviews of programs, functions, ports, protocols, and/or services; change control records; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with responsibilities for reviewing programs, functions, ports, protocols, and services on the system; personnel with information security responsibilities; system or network administrators; system developers].\n\n**TEST:** [SELECT FROM: Organizational processes for reviewing and disabling nonessential programs, functions, ports, protocols, or services; mechanisms implementing review and handling of nonessential programs, functions, ports, protocols, or services; organizational processes preventing program execution on the system; organizational processes for software program usage and restrictions; mechanisms supporting or implementing software program usage and restrictions; mechanisms preventing program execution on the system]."
              }
            ]
          },
          {
            "id": "c-3.4.8",
            "title": "Apply deny-by-exception (blacklisting) policy to prevent the use of unauthorized software or deny-all, permit-by-exception",
            "parts": [
              {
                "name": "statement",
                "prose": "Apply deny-by-exception (blacklisting) policy to prevent the use of unauthorized software or deny-all, permit-by-exception"
              },
              {
                "id": "c-3.4.8_obj.a",
                "name": "objective",
                "prose": "a policy specifying whether whitelisting or blacklisting is to be implemented is specified."
              },
              {
                "id": "c-3.4.8_obj.b",
                "name": "objective",
                "prose": "the software allowed to execute under whitelisting or denied use under blacklisting is specified."
              },
              {
                "id": "c-3.4.8_obj.c",
                "name": "objective",
                "prose": "whitelisting to allow the execution of authorized software or blacklisting to prevent the use of unauthorized software is implemented as specified."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Configuration management policy; procedures addressing least functionality in the system; security plan; configuration management plan; system design documentation; system configuration settings and associated documentation; list of software programs not authorized to execute on the system; list of software programs authorized to execute on the system; security configuration checklists; review and update records associated with list of authorized or unauthorized software programs; change control records; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with responsibilities for identifying software authorized or not authorized to execute on the system; personnel with information security responsibilities; system or network administrators].\n\n**TEST:** [SELECT FROM: Organizational process for identifying, reviewing, and updating programs authorized or not authorized to execute on the system; process for implementing blacklisting or whitelisting; mechanisms supporting or implementing blacklisting or whitelisting]."
              }
            ]
          },
          {
            "id": "c-3.4.9",
            "title": "Control and monitor user-installed software.",
            "parts": [
              {
                "name": "statement",
                "prose": "Control and monitor user-installed software."
              },
              {
                "id": "c-3.4.9_obj.a",
                "name": "objective",
                "prose": "a policy for controlling the installation of software by users is established."
              },
              {
                "id": "c-3.4.9_obj.b",
                "name": "objective",
                "prose": "installation of software by users is controlled based on the established policy."
              },
              {
                "id": "c-3.4.9_obj.c",
                "name": "objective",
                "prose": "installation of software by users is monitored."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Configuration management policy; procedures addressing user installed software; configuration management plan; security plan; system design documentation; system configuration settings and associated documentation; list of rules governing user-installed software; system monitoring records; system audit logs and records; continuous monitoring strategy; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with responsibilities for governing user-installed software; personnel operating, using, or maintaining the system; personnel monitoring compliance with user-installed software policy; personnel with information security responsibilities; system or network administrators].\n\n**TEST:** [SELECT FROM: Organizational processes governing user-installed software on the system; mechanisms enforcing rules or methods for governing the installation of software by users; mechanisms monitoring policy compliance]."
              }
            ]
          }
        ]
      },
      {
        "id": "c-3.5",
        "title": "Identification and Authentication",
        "class": "family",
        "controls": [
          {
            "id": "c-3.5.1",
            "title": "Identify system users, processes acting on behalf of users, and devices.",
            "parts": [
              {
                "name": "statement",
                "prose": "Identify system users, processes acting on behalf of users, and devices."
              },
              {
                "id": "c-3.5.1_obj.a",
                "name": "objective",
                "prose": "system users are identified."
              },
              {
                "id": "c-3.5.1_obj.b",
                "name": "objective",
                "prose": "processes acting on behalf of users are identified."
              },
              {
                "id": "c-3.5.1_obj.c",
                "name": "objective",
                "prose": "devices accessing the system are identified."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Identification and authentication policy; procedures addressing user identification and authentication; security plan, system design documentation; system configuration settings and associated documentation; system audit logs and records; list of system accounts; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with system operations responsibilities; personnel with information security responsibilities; system or network administrators; personnel with account management responsibilities; system developers].\n\n**TEST:** [SELECT FROM: Organizational processes for uniquely identifying and authenticating users; mechanisms supporting or implementing identification and authentication capability]."
              }
            ]
          },
          {
            "id": "c-3.5.2",
            "title": "Authenticate or verify the identities of users, processes, or devices, as a prerequisite to allowing access to organizational systems. ",
            "parts": [
              {
                "name": "statement",
                "prose": "Authenticate or verify the identities of users, processes, or devices, as a prerequisite to allowing access to organizational systems. "
              },
              {
                "id": "c-3.5.2_obj.a",
                "name": "objective",
                "prose": "the identity of each user is authenticated or verified as a prerequisite to system access."
              },
              {
                "id": "c-3.5.2_obj.b",
                "name": "objective",
                "prose": "the identity of each process acting on behalf of a user is authenticated or verified as a prerequisite to system access."
              },
              {
                "id": "c-3.5.2_obj.c",
                "name": "objective",
                "prose": "the identity of each device accessing or connecting to the system is authenticated or verified as a prerequisite to system access."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Identification and authentication policy; procedures addressing authenticator management; security plan; system design documentation; system configuration settings and associated documentation; list of system authenticator types; change control records associated with managing system authenticators; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with authenticator management responsibilities; personnel with information security responsibilities; system or network administrators].\n\n**TEST:** [SELECT FROM: Mechanisms supporting or implementing authenticator management capability]."
              }
            ]
          },
          {
            "id": "c-3.5.3",
            "title": "Use multifactor authentication for local and network access to privileged accounts and for network access to non-privileged accounts.",
            "parts": [
              {
                "name": "statement",
                "prose": "Use multifactor authentication for local and network access to privileged accounts and for network access to non-privileged accounts."
              },
              {
                "id": "c-3.5.3_obj.a",
                "name": "objective",
                "prose": "privileged accounts are identified."
              },
              {
                "id": "c-3.5.3_obj.b",
                "name": "objective",
                "prose": "multifactor authentication is implemented for local access to privileged accounts."
              },
              {
                "id": "c-3.5.3_obj.c",
                "name": "objective",
                "prose": "multifactor authentication is implemented for network access to privileged accounts."
              },
              {
                "id": "c-3.5.3_obj.d",
                "name": "objective",
                "prose": "multifactor authentication is implemented for network access to non-privileged accounts."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Identification and authentication policy; procedures addressing user identification and authentication; security plan; system design documentation; system configuration settings and associated documentation; system audit logs and records; list of system accounts; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with system operations responsibilities; personnel with account management responsibilities; personnel with information security responsibilities; system or network administrators; system developers].\n\n**TEST:** [SELECT FROM: Mechanisms supporting or implementing multifactor authentication capability]."
              }
            ]
          },
          {
            "id": "c-3.5.4",
            "title": "Employ replay-resistant authentication mechanisms for network access to privileged and non-privileged accounts.",
            "parts": [
              {
                "name": "statement",
                "prose": "Employ replay-resistant authentication mechanisms for network access to privileged and non-privileged accounts."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Identification and authentication policy; procedures addressing user identification and authentication; security plan; system design documentation; system configuration settings and associated documentation; system audit logs and records; list of privileged system accounts; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with system operations responsibilities; personnel with account management responsibilities; personnel with information security responsibilities; system or network administrators; system developers].\n\n**TEST:** [SELECT FROM: Mechanisms supporting or implementing identification and authentication capability or replay resistant authentication mechanisms]."
              }
            ]
          },
          {
            "id": "c-3.5.5",
            "title": "Prevent reuse of identifiers for a defined period.",
            "parts": [
              {
                "name": "statement",
                "prose": "Prevent reuse of identifiers for a defined period."
              },
              {
                "id": "c-3.5.5_obj.a",
                "name": "objective",
                "prose": "a period within which identifiers cannot be reused is defined."
              },
              {
                "id": "c-3.5.5_obj.b",
                "name": "objective",
                "prose": "reuse of identifiers is prevented within the defined period."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Identification and authentication policy; procedures addressing identifier management; procedures addressing account management; security plan; system design documentation; system configuration settings and associated documentation; list of system accounts; list of identifiers generated from physical access control devices; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with identifier management responsibilities; personnel with information security responsibilities; system or network administrators; system developers].\n\n**TEST:** [SELECT FROM: Mechanisms supporting or implementing identifier management]."
              }
            ]
          },
          {
            "id": "c-3.5.6",
            "title": "Disable identifiers after a defined period of inactivity.",
            "parts": [
              {
                "name": "statement",
                "prose": "Disable identifiers after a defined period of inactivity."
              },
              {
                "id": "c-3.5.6_obj.a",
                "name": "objective",
                "prose": "a period of inactivity after which an identifier is disabled is defined."
              },
              {
                "id": "c-3.5.6_obj.b",
                "name": "objective",
                "prose": "identifiers are disabled after the defined period of inactivity."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Identification and authentication policy; procedures addressing identifier management; procedures addressing account management; security plan; system design documentation; system configuration settings and associated documentation; list of system accounts; list of identifiers generated from physical access control devices; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with identifier management responsibilities; personnel with information security responsibilities; system or network administrators; system developers].\n\n**TEST:** [SELECT FROM: Mechanisms supporting or implementing identifier management]."
              }
            ]
          },
          {
            "id": "c-3.5.7",
            "title": "Enforce a minimum password complexity and change of characters when new passwords are created.",
            "parts": [
              {
                "name": "statement",
                "prose": "Enforce a minimum password complexity and change of characters when new passwords are created."
              },
              {
                "id": "c-3.5.7_obj.a",
                "name": "objective",
                "prose": "password complexity requirements are defined."
              },
              {
                "id": "c-3.5.7_obj.b",
                "name": "objective",
                "prose": "password change of character requirements are defined."
              },
              {
                "id": "c-3.5.7_obj.c",
                "name": "objective",
                "prose": "minimum password complexity requirements as defined are enforced when new passwords are created."
              },
              {
                "id": "c-3.5.7_obj.d",
                "name": "objective",
                "prose": "minimum password change of character requirements as defined are enforced when new passwords are created."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Identification and authentication policy; password policy; procedures addressing authenticator management; security plan; system design documentation; system configuration settings and associated documentation; password configurations and associated documentation; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with authenticator management responsibilities; personnel with information security responsibilities; system or network administrators; system developers].\n\n**TEST:** [SELECT FROM: Mechanisms supporting or implementing password-based authenticator management capability]."
              }
            ]
          },
          {
            "id": "c-3.5.8",
            "title": "Prohibit password reuse for a specified number of generations.",
            "parts": [
              {
                "name": "statement",
                "prose": "Prohibit password reuse for a specified number of generations."
              },
              {
                "id": "c-3.5.8_obj.a",
                "name": "objective",
                "prose": "the number of generations during which a password cannot be reused is specified."
              },
              {
                "id": "c-3.5.8_obj.b",
                "name": "objective",
                "prose": "reuse of passwords is prohibited during the specified number of generations."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Identification and authentication policy; password policy; procedures addressing authenticator management; security plan; system design documentation; system configuration settings and associated documentation; password configurations and associated documentation; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with authenticator management responsibilities; personnel with information security responsibilities; system or network administrators; system developers].\n\n**TEST:** [SELECT FROM: Mechanisms supporting or implementing password-based authenticator management capability]."
              }
            ]
          },
          {
            "id": "c-3.5.9",
            "title": "Allow temporary password use for system logons with an immediate change to a permanent password",
            "parts": [
              {
                "name": "statement",
                "prose": "Allow temporary password use for system logons with an immediate change to a permanent password"
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Identification and authentication policy; password policy; procedures addressing authenticator management; security plan; system design documentation; system configuration settings and associated documentation; password configurations and associated documentation; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with authenticator management responsibilities; personnel with information security responsibilities; system or network administrators; system developers].\n\n**TEST:** [SELECT FROM: Mechanisms supporting or implementing password-based authenticator management capability]."
              }
            ]
          },
          {
            "id": "c-3.5.10",
            "title": "Store and transmit only cryptographically-protected passwords.",
            "parts": [
              {
                "name": "statement",
                "prose": "Store and transmit only cryptographically-protected passwords."
              },
              {
                "id": "c-3.5.10_obj.a",
                "name": "objective",
                "prose": "passwords are cryptographically protected in storage."
              },
              {
                "id": "c-3.5.10_obj.b",
                "name": "objective",
                "prose": "passwords are cryptographically protected in transit."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Identification and authentication policy; password policy; procedures addressing authenticator management; security plan; system design documentation; system configuration settings and associated documentation; password configurations and associated documentation; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with authenticator management responsibilities; personnel with information security responsibilities; system or network administrators; system developers].\n\n**TEST:** [SELECT FROM: Mechanisms supporting or implementing password-based authenticator management capability]."
              }
            ]
          },
          {
            "id": "c-3.5.11",
            "title": "Obscure feedback of authentication information.",
            "parts": [
              {
                "name": "statement",
                "prose": "Obscure feedback of authentication information."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Identification and authentication policy; procedures addressing authenticator feedback; security plan; system design documentation; system configuration settings and associated documentation; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with information security responsibilities; system or network administrators; system developers].\n\n**TEST:** [SELECT FROM: Mechanisms supporting or implementing the obscuring of feedback of authentication information during authentication]."
              }
            ]
          }
        ]
      },
      {
        "id": "c-3.6",
        "title": "Incident Response",
        "class": "family",
        "controls": [
          {
            "id": "c-3.6.1",
            "title": "Establish an operational incident-handling capability for organizational systems that includes preparation, detection, analysis, containment, recovery, and user response activities.",
            "parts": [
              {
                "name": "statement",
                "prose": "Establish an operational incident-handling capability for organizational systems that includes preparation, detection, analysis, containment, recovery, and user response activities."
              },
              {
                "id": "c-3.6.1_obj.a",
                "name": "objective",
                "prose": "an operational incident-handling capability is established."
              },
              {
                "id": "c-3.6.1_obj.b",
                "name": "objective",
                "prose": "the operational incident-handling capability includes preparation."
              },
              {
                "id": "c-3.6.1_obj.c",
                "name": "objective",
                "prose": "the operational incident-handling capability includes detection."
              },
              {
                "id": "c-3.6.1_obj.d",
                "name": "objective",
                "prose": "the operational incident-handling capability includes analysis."
              },
              {
                "id": "c-3.6.1_obj.e",
                "name": "objective",
                "prose": "the operational incident-handling capability includes containment."
              },
              {
                "id": "c-3.6.1_obj.f",
                "name": "objective",
                "prose": "the operational incident-handling capability includes recovery."
              },
              {
                "id": "c-3.6.1_obj.g",
                "name": "objective",
                "prose": "the operational incident-handling capability includes user response activities."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Incident response policy; contingency planning policy; procedures addressing incident handling; procedures addressing incident response assistance; incident response plan; contingency plan; security plan; procedures addressing incident response training; incident response training curriculum; incident response training materials; incident response training records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with incident handling responsibilities; personnel with contingency planning responsibilities; personnel with incident response training and operational responsibilities; personnel with incident response assistance and support responsibilities; personnel with access to incident response support and assistance capability; personnel with information security responsibilities].\n\n**TEST:** [SELECT FROM: Incident-handling capability for the organization; organizational processes for incident response assistance; mechanisms supporting or implementing incident response assistance]."
              }
            ]
          },
          {
            "id": "c-3.6.2",
            "title": "Track, document, and report incidents to designated officials and/or authorities both internal and external to the organization.",
            "parts": [
              {
                "name": "statement",
                "prose": "Track, document, and report incidents to designated officials and/or authorities both internal and external to the organization."
              },
              {
                "id": "c-3.6.2_obj.a",
                "name": "objective",
                "prose": "incidents are tracked."
              },
              {
                "id": "c-3.6.2_obj.b",
                "name": "objective",
                "prose": "incidents are documented."
              },
              {
                "id": "c-3.6.2_obj.c",
                "name": "objective",
                "prose": "authorities to whom incidents are to be reported are identified."
              },
              {
                "id": "c-3.6.2_obj.d",
                "name": "objective",
                "prose": "organizational officials to whom incidents are to be reported are identified."
              },
              {
                "id": "c-3.6.2_obj.e",
                "name": "objective",
                "prose": "identified authorities are notified of incidents."
              },
              {
                "id": "c-3.6.2_obj.f",
                "name": "objective",
                "prose": "identified organizational officials are notified of incidents."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Incident response policy; procedures addressing incident monitoring; incident response records and documentation; procedures addressing incident reporting; incident reporting records and documentation; incident response plan; security plan; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with incident monitoring responsibilities; personnel with incident reporting responsibilities; personnel who have or should have reported incidents; personnel (authorities) to whom incident information is to be reported; personnel with information security responsibilities].\n\n**TEST:** [SELECT FROM: Incident monitoring capability for the organization; mechanisms supporting or implementing tracking and documenting of system security incidents; organizational processes for incident reporting; mechanisms supporting or implementing incident reporting]."
              }
            ]
          },
          {
            "id": "c-3.6.3",
            "title": "Test the organizational incident response capability.",
            "parts": [
              {
                "name": "statement",
                "prose": "Test the organizational incident response capability."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Incident response policy; contingency planning policy; procedures addressing incident response testing; procedures addressing contingency plan testing; incident response testing material; incident response test results; incident response test plan; incident response plan; contingency plan; security plan; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with incident response testing responsibilities; personnel with information security responsibilities]."
              }
            ]
          }
        ]
      },
      {
        "id": "c-3.7",
        "title": "Maintenance",
        "class": "family",
        "controls": [
          {
            "id": "c-3.7.1",
            "title": "Perform maintenance on organizational systems.",
            "parts": [
              {
                "name": "statement",
                "prose": "Perform maintenance on organizational systems."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: System maintenance policy; procedures addressing controlled system maintenance; maintenance records; manufacturer or vendor maintenance specifications; equipment sanitization records; media sanitization records; security plan; other relevant documents or records].\n\n**INTERVIEW:** [select from: Personnel with system maintenance responsibilities; personnel with information security responsibilities; personnel responsible for media sanitization; system or network administrators].\n\n**TEST:** [SELECT FROM: Organizational processes for scheduling, performing, documenting, reviewing, approving, and monitoring maintenance and repairs for systems; organizational processes for sanitizing system components; mechanisms supporting or implementing controlled maintenance; mechanisms implementing sanitization of system components]."
              }
            ]
          },
          {
            "id": "c-3.7.2",
            "title": "Provide controls on the tools, techniques, mechanisms, and personnel used to conduct system maintenance.",
            "parts": [
              {
                "name": "statement",
                "prose": "Provide controls on the tools, techniques, mechanisms, and personnel used to conduct system maintenance."
              },
              {
                "id": "c-3.7.2_obj.a",
                "name": "objective",
                "prose": "tools used to conduct system maintenance are controlled."
              },
              {
                "id": "c-3.7.2_obj.b",
                "name": "objective",
                "prose": "techniques used to conduct system maintenance are controlled."
              },
              {
                "id": "c-3.7.2_obj.c",
                "name": "objective",
                "prose": "mechanisms used to conduct system maintenance are controlled."
              },
              {
                "id": "c-3.7.2_obj.d",
                "name": "objective",
                "prose": "personnel used to conduct system maintenance are controlled."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: System maintenance policy; procedures addressing system maintenance tools and media; maintenance records; system maintenance tools and associated documentation; maintenance tool inspection records; security plan; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with system maintenance responsibilities; personnel with information security responsibilities].\n\n**TEST:** [SELECT FROM: Organizational processes for approving, controlling, and monitoring maintenance tools; mechanisms supporting or implementing approval, control, and monitoring of maintenance tools; organizational processes for inspecting maintenance tools; mechanisms supporting or implementing inspection of maintenance tools; organizational process for inspecting media for malicious code; mechanisms supporting or implementing inspection of media used for maintenance]."
              }
            ]
          },
          {
            "id": "c-3.7.3",
            "title": "Ensure equipment removed for off-site maintenance is sanitized of any CUI.",
            "parts": [
              {
                "name": "statement",
                "prose": "Ensure equipment removed for off-site maintenance is sanitized of any CUI."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: System maintenance policy; procedures addressing controlled system maintenance; maintenance records; manufacturer or vendor maintenance specifications; equipment sanitization records; media sanitization records; security plan; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with system maintenance responsibilities; personnel with information security responsibilities; personnel responsible for media sanitization; system or network administrators].\n\n**TEST:** [select from: Organizational processes for scheduling, performing, documenting, reviewing, approving, and monitoring maintenance and repairs for systems; organizational processes for sanitizing system components; mechanisms supporting or implementing controlled maintenance; mechanisms implementing sanitization of system components]."
              }
            ]
          },
          {
            "id": "c-3.7.4",
            "title": "Check media containing diagnostic and test programs for malicious code before the media are used in organizational systems",
            "parts": [
              {
                "name": "statement",
                "prose": "Check media containing diagnostic and test programs for malicious code before the media are used in organizational systems"
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: System maintenance policy; procedures addressing system maintenance tools; system maintenance tools and associated documentation; maintenance records; security plan; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with system maintenance responsibilities; personnel with information security responsibilities].\n\n**TEST:** [select from: Organizational process for inspecting media for malicious code; mechanisms supporting or implementing inspection of media used for maintenance]."
              }
            ]
          },
          {
            "id": "c-3.7.5",
            "title": "Require multifactor authentication to establish nonlocal maintenance sessions via external network connections and terminate such connections when nonlocal maintenance is complete.",
            "parts": [
              {
                "name": "statement",
                "prose": "Require multifactor authentication to establish nonlocal maintenance sessions via external network connections and terminate such connections when nonlocal maintenance is complete."
              },
              {
                "id": "c-3.7.5_obj.a",
                "name": "objective",
                "prose": "multifactor authentication is required to establish nonlocal maintenance sessions via external network connections."
              },
              {
                "id": "c-3.7.5_obj.b",
                "name": "objective",
                "prose": "nonlocal maintenance sessions established via external network connections are terminated when nonlocal maintenance is complete."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: System maintenance policy; procedures addressing nonlocal system maintenance; security plan; system design documentation; system configuration settings and associated documentation; maintenance records; diagnostic records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with system maintenance responsibilities; personnel with information security responsibilities; system or network administrators].\n\n**TEST:** [select from: Organizational processes for managing nonlocal maintenance; mechanisms implementing, supporting, and managing nonlocal maintenance; mechanisms for strong authentication of nonlocal maintenance diagnostic sessions; mechanisms for terminating nonlocal maintenance sessions and network connections]."
              }
            ]
          },
          {
            "id": "c-3.7.6",
            "title": "Supervise the maintenance activities of maintenance personnel without required access authorization.",
            "parts": [
              {
                "name": "statement",
                "prose": "Supervise the maintenance activities of maintenance personnel without required access authorization."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: System maintenance policy; procedures addressing maintenance personnel; service provider contracts; service-level agreements; list of authorized personnel; maintenance records; access control records; security plan; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with system maintenance responsibilities; personnel with information security responsibilities].\n\n**TEST:** [SELECT FROM: Organizational processes for authorizing and managing maintenance personnel; mechanisms supporting or implementing authorization of maintenance personnel]."
              }
            ]
          }
        ]
      },
      {
        "id": "c-3.8",
        "title": "Media Protection",
        "class": "family",
        "controls": [
          {
            "id": "c-3.8.1",
            "title": "Protect (i.e., physically control and securely store) system media containing CUI, both paper and digital. ",
            "parts": [
              {
                "name": "statement",
                "prose": "Protect (i.e., physically control and securely store) system media containing CUI, both paper and digital. "
              },
              {
                "id": "c-3.8.1_obj.a",
                "name": "objective",
                "prose": "paper media containing CUI is physically controlled."
              },
              {
                "id": "c-3.8.1_obj.b",
                "name": "objective",
                "prose": "digital media containing CUI is physically controlled."
              },
              {
                "id": "c-3.8.1_obj.c",
                "name": "objective",
                "prose": "paper media containing CUI is securely stored."
              },
              {
                "id": "c-3.8.1_obj.d",
                "name": "objective",
                "prose": "digital media containing CUI is securely stored."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: System media protection policy; procedures addressing media access restrictions; access control policy and procedures; physical and environmental protection policy and procedures; security plan; media storage facilities; access control records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with system media protection responsibilities; personnel with information security responsibilities; system or network administrators].\n\n**TEST:** [SELECT FROM: Organizational processes for restricting information media; mechanisms supporting or implementing media access restrictions]."
              }
            ]
          },
          {
            "id": "c-3.8.2",
            "title": "Limit access to CUI on system media to authorized users.",
            "parts": [
              {
                "name": "statement",
                "prose": "Limit access to CUI on system media to authorized users."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: System media protection policy; procedures addressing media storage; physical and environmental protection policy and procedures; access control policy and procedures; security plan; system media; designated controlled areas; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with system media protection and storage responsibilities; personnel with information security responsibilities].\n\n**TEST:** [SELECT FROM: Organizational processes for storing media; mechanisms supporting or implementing secure media storage and media protection]."
              }
            ]
          },
          {
            "id": "c-3.8.3",
            "title": "Sanitize or destroy system media containing CUI before disposal or release for reuse.",
            "parts": [
              {
                "name": "statement",
                "prose": "Sanitize or destroy system media containing CUI before disposal or release for reuse."
              },
              {
                "id": "c-3.8.3_obj.a",
                "name": "objective",
                "prose": "system media containing CUI is sanitized or destroyed before disposal."
              },
              {
                "id": "c-3.8.3_obj.b",
                "name": "objective",
                "prose": "system media containing CUI is sanitized before it is released for reuse."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: System media protection policy; procedures addressing media sanitization and disposal; applicable standards and policies addressing media sanitization; security plan; media sanitization records; system audit logs and records; system design documentation; system configuration settings and associated documentation; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with media sanitization responsibilities; personnel with information security responsibilities; system or network administrators].\n\n**TEST:** [SELECT FROM: Organizational processes for media sanitization; mechanisms supporting or implementing media sanitization]."
              }
            ]
          },
          {
            "id": "c-3.8.4",
            "title": "Mark media with necessary CUI markings and distribution limitations.",
            "parts": [
              {
                "name": "statement",
                "prose": "Mark media with necessary CUI markings and distribution limitations."
              },
              {
                "id": "c-3.8.4_obj.a",
                "name": "objective",
                "prose": "media containing CUI is marked with applicable CUI markings."
              },
              {
                "id": "c-3.8.4_obj.b",
                "name": "objective",
                "prose": "media containing CUI is marked with distribution limitations."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: System media protection policy; procedures addressing media marking; physical and environmental protection policy and procedures; security plan; list of system media marking security attributes; designated controlled areas; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with system media protection and marking responsibilities; personnel with information security responsibilities].\n\n**TEST:** [SELECT FROM: Organizational processes for marking information media; mechanisms supporting or implementing media marking]."
              }
            ]
          },
          {
            "id": "c-3.8.5",
            "title": "Control access to media containing CUI and maintain accountability for media during transport outside of controlled areas.",
            "parts": [
              {
                "name": "statement",
                "prose": "Control access to media containing CUI and maintain accountability for media during transport outside of controlled areas."
              },
              {
                "id": "c-3.8.5_obj.a",
                "name": "objective",
                "prose": "access to media containing CUI is controlled."
              },
              {
                "id": "c-3.8.5_obj.b",
                "name": "objective",
                "prose": "accountability for media containing CUI is maintained during transport outside of controlled areas."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** SELECT FROM: System media protection policy; procedures addressing media storage; physical and environmental protection policy and procedures; access control policy and procedures; security plan; system media; designated controlled areas; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with system media protection and storage responsibilities; personnel with information security responsibilities; system or network administrators].\n\n**TEST:** [SELECT FROM: Organizational processes for storing media; mechanisms supporting or implementing media storage and media protection]."
              }
            ]
          },
          {
            "id": "c-3.8.6",
            "title": "Implement cryptographic mechanisms to protect the confidentiality of CUI stored on digital media during transport unless otherwise protected by alternative physical safeguards.",
            "parts": [
              {
                "name": "statement",
                "prose": "Implement cryptographic mechanisms to protect the confidentiality of CUI stored on digital media during transport unless otherwise protected by alternative physical safeguards."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: System media protection policy; procedures addressing media transport; system design documentation; security plan; system configuration settings and associated documentation; system media transport records; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with system media transport responsibilities; personnel with information security responsibilities].\n\n**TEST:** [SELECT FROM: Cryptographic mechanisms protecting information on digital media during transportation outside controlled areas]."
              }
            ]
          },
          {
            "id": "c-3.8.7",
            "title": "Control the use of removable media on system components.",
            "parts": [
              {
                "name": "statement",
                "prose": "Control the use of removable media on system components."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: System media protection policy; system use policy; procedures addressing media usage restrictions; security plan; rules of behavior; system design documentation; system configuration settings and associated documentation; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with system media use responsibilities; personnel with information security responsibilities; system or network administrators].\n\n**TEST:** [SELECT FROM: Organizational processes for media use; mechanisms restricting or prohibiting use of system media on systems or system components]."
              }
            ]
          },
          {
            "id": "c-3.8.8",
            "title": "Prohibit the use of portable storage devices when such devices have no identifiable owner.",
            "parts": [
              {
                "name": "statement",
                "prose": "Prohibit the use of portable storage devices when such devices have no identifiable owner."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: System media protection policy; system use policy; procedures addressing media usage restrictions; security plan; rules of behavior; system design documentation; system configuration settings and associated documentation; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with system media use responsibilities; personnel with information security responsibilities; system or network administrators].\n\n**TEST:** [SELECT FROM: Organizational processes for media use; mechanisms prohibiting use of media on systems or system components]."
              }
            ]
          },
          {
            "id": "c-3.8.9",
            "title": "Protect the confidentiality of backup CUI at storage locations.",
            "parts": [
              {
                "name": "statement",
                "prose": "Protect the confidentiality of backup CUI at storage locations."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Procedures addressing system backup; security plan; backup storage location(s); system backup logs or records; other relevant documents or records].\n\n**INTERVIEW:** [[SELECT FROM: Personnel with system backup responsibilities; personnel with information security responsibilities].\n\n**TEST:** [SELECT FROM: Organizational processes for conducting system backups; mechanisms supporting or implementing system backups]."
              }
            ]
          }
        ]
      },
      {
        "id": "c-3.9",
        "title": "Personnel Security",
        "class": "family",
        "controls": [
          {
            "id": "c-3.9.1",
            "title": "Screen individuals prior to authorizing access to organizational systems containing CUI.",
            "parts": [
              {
                "name": "statement",
                "prose": "Screen individuals prior to authorizing access to organizational systems containing CUI."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Personnel security policy; procedures addressing personnel screening; records of screened personnel; security plan; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with personnel security responsibilities; personnel with information security responsibilities].\n\n**TEST:** [SELECT FROM: Organizational processes for personnel screening]."
              }
            ]
          },
          {
            "id": "c-3.9.2",
            "title": "Ensure that organizational systems containing CUI are protected during and after personnel actions such as terminations and transfers.",
            "parts": [
              {
                "name": "statement",
                "prose": "Ensure that organizational systems containing CUI are protected during and after personnel actions such as terminations and transfers."
              },
              {
                "id": "c-3.9.2_obj.a",
                "name": "objective",
                "prose": "a policy and/or process for terminating system access authorization and any credentials coincident with personnel actions is established."
              },
              {
                "id": "c-3.9.2_obj.b",
                "name": "objective",
                "prose": "system access and credentials are terminated consistent with personnel actions such as termination or transfer."
              },
              {
                "id": "c-3.9.2_obj.c",
                "name": "objective",
                "prose": "the system is protected during and after personnel transfer actions."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Personnel security policy; procedures addressing personnel transfer and termination; records of personnel transfer and termination actions; list of system accounts; records of terminated or revoked authenticators and credentials; records of exit interviews; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with personnel security responsibilities; personnel with account management responsibilities; system or network administrators; personnel with information security responsibilities].\n\n**TEST:** [SELECT FROM: Organizational processes for personnel transfer and termination; mechanisms supporting or implementing personnel transfer and termination notifications; mechanisms for disabling system access and revoking authenticators]."
              }
            ]
          }
        ]
      },
      {
        "id": "c-3.10",
        "title": "Physical Protection",
        "class": "family",
        "controls": [
          {
            "id": "c-3.10.1",
            "title": "Limit physical access to organizational systems, equipment, and the respective operating environments to authorized individuals.",
            "parts": [
              {
                "name": "statement",
                "prose": "Limit physical access to organizational systems, equipment, and the respective operating environments to authorized individuals."
              },
              {
                "id": "c-3.10.1_obj.a",
                "name": "objective",
                "prose": "authorized individuals allowed physical access are identified."
              },
              {
                "id": "c-3.10.1_obj.b",
                "name": "objective",
                "prose": "physical access to organizational systems is limited to authorized individuals."
              },
              {
                "id": "c-3.10.1_obj.c",
                "name": "objective",
                "prose": "physical access to equipment is limited to authorized individuals."
              },
              {
                "id": "c-3.10.1_obj.d",
                "name": "objective",
                "prose": "physical access to operating environments is limited to authorized individuals."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Physical and environmental protection policy; procedures addressing physical access authorizations; security plan; authorized personnel access list; authorization credentials; physical access list reviews; physical access termination records and associated documentation; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with physical access authorization responsibilities; personnel with physical access to system facility; personnel with information security responsibilities].\n\n**TEST:** [SELECT FROM: Organizational processes for physical access authorizations; mechanisms supporting or implementing physical access authorizations]."
              }
            ]
          },
          {
            "id": "c-3.10.2",
            "title": "Protect and monitor the physical facility and support infrastructure for organizational systems.",
            "parts": [
              {
                "name": "statement",
                "prose": "Protect and monitor the physical facility and support infrastructure for organizational systems."
              },
              {
                "id": "c-3.10.2_obj.a",
                "name": "objective",
                "prose": "the physical facility where that system resides is protected."
              },
              {
                "id": "c-3.10.2_obj.b",
                "name": "objective",
                "prose": "the support infrastructure for that system is protected."
              },
              {
                "id": "c-3.10.2_obj.c",
                "name": "objective",
                "prose": "the physical facility where that system resides is monitored."
              },
              {
                "id": "c-3.10.2_obj.d",
                "name": "objective",
                "prose": "the support infrastructure for that system is monitored."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Physical and environmental protection policy; procedures addressing physical access monitoring; security plan; physical access logs or records; physical access monitoring records; physical access log reviews; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with physical access monitoring responsibilities; personnel with incident response responsibilities; personnel with information security responsibilities].\n\n**TEST:** [SELECT FROM: Organizational processes for monitoring physical access; mechanisms supporting or implementing physical access monitoring; mechanisms supporting or implementing the review of physical access logs]."
              }
            ]
          },
          {
            "id": "c-3.10.3",
            "title": "Escort visitors and monitor visitor activity.",
            "parts": [
              {
                "name": "statement",
                "prose": "Escort visitors and monitor visitor activity."
              },
              {
                "id": "c-3.10.3_obj.a",
                "name": "objective",
                "prose": "visitors are escorted."
              },
              {
                "id": "c-3.10.3_obj.b",
                "name": "objective",
                "prose": "visitor activity is monitored."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Physical and environmental protection policy; procedures addressing physical access control; security plan; physical access control logs or records; inventory records of physical access control devices; system entry and exit points; records of key and lock combination changes; storage locations for physical access control devices; physical access control devices; list of security safeguards controlling access to designated publicly accessible areas within facility; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with physical access control responsibilities; personnel with information security responsibilities].\n\n**TEST:** [SELECT FROM: Organizational processes for physical access control; mechanisms supporting or implementing physical access control; physical access control devices]."
              }
            ]
          },
          {
            "id": "c-3.10.4",
            "title": "Maintain audit logs of physical access.",
            "parts": [
              {
                "name": "statement",
                "prose": "Maintain audit logs of physical access."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Physical and environmental protection policy; procedures addressing physical access control; security plan; physical access control logs or records; inventory records of physical access control devices; system entry and exit points; records of key and lock combination changes; storage locations for physical access control devices; physical access control devices; list of security safeguards controlling access to designated publicly accessible areas within facility; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with physical access control responsibilities; personnel with information security responsibilities\n\n**TEST:** [SELECT FROM: Organizational processes for physical access control; mechanisms supporting or implementing physical access control; physical access control devices]."
              }
            ]
          },
          {
            "id": "c-3.10.5",
            "title": "Control and manage physical access devices.",
            "parts": [
              {
                "name": "statement",
                "prose": "Control and manage physical access devices."
              },
              {
                "id": "c-3.10.5_obj.a",
                "name": "objective",
                "prose": "physical access devices are identified."
              },
              {
                "id": "c-3.10.5_obj.b",
                "name": "objective",
                "prose": "physical access devices are controlled."
              },
              {
                "id": "c-3.10.5_obj.c",
                "name": "objective",
                "prose": "physical access devices are managed."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Physical and environmental protection policy; procedures addressing physical access control; security plan; physical access control logs or records; inventory records of physical access control devices; system entry and exit points; records of key and lock combination changes; storage locations for physical access control devices; physical access control devices; list of security safeguards controlling access to designated publicly accessible areas within facility; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with physical access control responsibilities; personnel with information security responsibilities].\n\n**TEST:** [SELECT FROM: Organizational processes for physical access control; mechanisms supporting or implementing physical access control; physical access control devices]."
              }
            ]
          },
          {
            "id": "c-3.10.6",
            "title": "Enforce safeguarding measures for CUI at alternate work sites.",
            "parts": [
              {
                "name": "statement",
                "prose": "Enforce safeguarding measures for CUI at alternate work sites."
              },
              {
                "id": "c-3.10.6_obj.a",
                "name": "objective",
                "prose": "safeguarding measures for CUI are defined for alternate work sites."
              },
              {
                "id": "c-3.10.6_obj.b",
                "name": "objective",
                "prose": "safeguarding measures for CUI are enforced for alternate work sites."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Physical and environmental protection policy; procedures addressing alternate work sites for personnel; security plan; list of safeguards required for alternate work sites; assessments of safeguards at alternate work sites; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel approving use of alternate work sites; personnel using alternate work sites; personnel assessing controls at alternate work sites; personnel with information security responsibilities].\n\n**TEST:** [SELECT FROM: Organizational processes for security at alternate work sites; mechanisms supporting alternate work sites; safeguards employed at alternate work sites; means of communications between personnel at alternate work sites and security personnel]."
              }
            ]
          }
        ]
      },
      {
        "id": "c-3.11",
        "title": "Risk Assessment",
        "class": "family",
        "controls": [
          {
            "id": "c-3.11.1",
            "title": "Periodically assess the risk to organizational operations",
            "parts": [
              {
                "name": "statement",
                "prose": "Periodically assess the risk to organizational operations"
              },
              {
                "id": "c-3.11.1_obj.a",
                "name": "objective",
                "prose": "the frequency to assess risk to organizational operations, organizational assets, and individuals is defined."
              },
              {
                "id": "c-3.11.1_obj.b",
                "name": "objective",
                "prose": "risk to organizational operations, organizational assets, and individuals resulting from the operation of an organizational system that processes, stores, or transmits CUI is assessed with the defined frequency."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Risk assessment policy; security planning policy and procedures; procedures addressing organizational risk assessments; security plan; risk assessment; risk assessment results; risk assessment reviews; risk assessment updates; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with risk assessment responsibilities; personnel with information security responsibilities].\n\n**TEST:** [SELECT FROM: Organizational processes for risk assessment; mechanisms supporting or for conducting, documenting, reviewing, disseminating, and updating the risk assessment]."
              }
            ]
          },
          {
            "id": "c-3.11.2",
            "title": "Scan for vulnerabilities in organizational systems and applications periodically and when new vulnerabilities affecting those systems and applications are identified.",
            "parts": [
              {
                "name": "statement",
                "prose": "Scan for vulnerabilities in organizational systems and applications periodically and when new vulnerabilities affecting those systems and applications are identified."
              },
              {
                "id": "c-3.11.2_obj.a",
                "name": "objective",
                "prose": "the frequency to scan for vulnerabilities in an organizational system and its applications that process, store, or transmit CUI is defined."
              },
              {
                "id": "c-3.11.2_obj.b",
                "name": "objective",
                "prose": "vulnerability scans are performed in an organizational system that processes, stores, or transmits CUI with the defined frequency."
              },
              {
                "id": "c-3.11.2_obj.c",
                "name": "objective",
                "prose": "vulnerability scans are performed in an application that contains CUI with the defined frequency."
              },
              {
                "id": "c-3.11.2_obj.d",
                "name": "objective",
                "prose": "vulnerability scans are performed in an organizational system that processes, stores, or transmits CUI when new vulnerabilities are identified."
              },
              {
                "id": "c-3.11.2_obj.e",
                "name": "objective",
                "prose": "vulnerability scans are performed in an application that contains CUI when new vulnerabilities are identified."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Risk assessment policy; procedures addressing vulnerability scanning; risk assessment; security plan; security assessment report; vulnerability scanning tools and associated configuration documentation; vulnerability scanning results; patch and vulnerability management records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with risk assessment, security assessment and vulnerability scanning responsibilities; personnel with vulnerability scan analysis and remediation responsibilities; personnel with information security responsibilities; system or network administrators].\n\n**TEST:** [SELECT FROM: Organizational processes for vulnerability scanning, analysis, remediation, and information sharing; mechanisms supporting or implementing vulnerability scanning, analysis, remediation, and information sharing]."
              }
            ]
          },
          {
            "id": "c-3.11.3",
            "title": "Remediate vulnerabilities in accordance with risk assessments.",
            "parts": [
              {
                "name": "statement",
                "prose": "Remediate vulnerabilities in accordance with risk assessments."
              },
              {
                "id": "c-3.11.3_obj.a",
                "name": "objective",
                "prose": "vulnerabilities are identified."
              },
              {
                "id": "c-3.11.3_obj.b",
                "name": "objective",
                "prose": "vulnerabilities are remediated in accordance with risk assessments."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Risk assessment policy; procedures addressing vulnerability scanning; risk assessment; security plan; security assessment report; vulnerability scanning tools and associated configuration documentation; vulnerability scanning results; patch and vulnerability management records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with risk assessment, security assessment and vulnerability scanning responsibilities; personnel with vulnerability scan analysis responsibilities; personnel with vulnerability remediation responsibilities; personnel with information security responsibilities; system or network administrators].\n\n**TEST:** [SELECT FROM: Organizational processes for vulnerability scanning, analysis, remediation, and information sharing; mechanisms supporting or implementing vulnerability scanning, analysis, remediation, and information sharing]."
              }
            ]
          }
        ]
      },
      {
        "id": "c-3.12",
        "title": "Security Assessment",
        "class": "family",
        "controls": [
          {
            "id": "c-3.12.1",
            "title": "Periodically assess the security controls in organizational systems to determine if the controls are effective in their application.",
            "parts": [
              {
                "name": "statement",
                "prose": "Periodically assess the security controls in organizational systems to determine if the controls are effective in their application."
              },
              {
                "id": "c-3.12.1_obj.a",
                "name": "objective",
                "prose": "the frequency of security control assessments is defined."
              },
              {
                "id": "c-3.12.1_obj.b",
                "name": "objective",
                "prose": "security controls are assessed with the defined frequency to determine if the controls are effective in their application."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Security assessment and authorization policy; procedures addressing security assessment planning; procedures addressing security assessments; security assessment plan; security plan; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with security assessment responsibilities; personnel with information security responsibilities].\n\n**TEST:** [SELECT FROM: Mechanisms supporting security assessment, security assessment plan development, and security assessment reporting]."
              }
            ]
          },
          {
            "id": "c-3.12.2",
            "title": "Develop and implement plans of action designed to correct deficiencies and reduce or eliminate vulnerabilities in organizational systems",
            "parts": [
              {
                "name": "statement",
                "prose": "Develop and implement plans of action designed to correct deficiencies and reduce or eliminate vulnerabilities in organizational systems"
              },
              {
                "id": "c-3.12.2_obj.a",
                "name": "objective",
                "prose": "deficiencies and vulnerabilities to be addressed by the plan of action are identified."
              },
              {
                "id": "c-3.12.2_obj.b",
                "name": "objective",
                "prose": "a plan of action is developed to correct identified deficiencies and reduce or eliminate identified vulnerabilities."
              },
              {
                "id": "c-3.12.2_obj.c",
                "name": "objective",
                "prose": "the plan of action is implemented to correct identified deficiencies and reduce or eliminate identified vulnerabilities."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Security assessment and authorization policy; procedures addressing plan of action; security plan; security assessment plan; security assessment report; security assessment evidence; plan of action; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with plan of action development and implementation responsibilities; personnel with information security responsibilities].\n\n**TEST:** [SELECT FROM: Mechanisms for developing, implementing, and maintaining plan of action]."
              }
            ]
          },
          {
            "id": "c-3.12.3",
            "title": "Monitor security controls on an ongoing basis to ensure the continued effectiveness of the controls.",
            "parts": [
              {
                "name": "statement",
                "prose": "Monitor security controls on an ongoing basis to ensure the continued effectiveness of the controls."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Security planning policy; organizational procedures addressing security plan development and implementation; procedures addressing security plan reviews and updates; enterprise architecture documentation; security plan; records of security plan reviews and updates; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with security planning and plan implementation responsibilities; personnel with information security responsibilities].\n\n**TEST:** [SELECT FROM: Organizational processes for security plan development, review, update, and approval; mechanisms supporting the security plan]."
              }
            ]
          },
          {
            "id": "c-3.12.4",
            "title": "Develop, document, and periodically update system security plans that describe system boundaries, system environments of operation, how security requirements are implemented, and the relationships with or connections to other systems.",
            "parts": [
              {
                "name": "statement",
                "prose": "Develop, document, and periodically update system security plans that describe system boundaries, system environments of operation, how security requirements are implemented, and the relationships with or connections to other systems."
              },
              {
                "id": "c-3.12.4_obj.a",
                "name": "objective",
                "prose": "a system security plan is developed."
              },
              {
                "id": "c-3.12.4_obj.b",
                "name": "objective",
                "prose": "the system boundary is described and documented in the system security plan."
              },
              {
                "id": "c-3.12.4_obj.c",
                "name": "objective",
                "prose": "the system environment of operation is described and documented in the system security plan."
              },
              {
                "id": "c-3.12.4_obj.d",
                "name": "objective",
                "prose": "the security requirements identified and approved by the designated authority as non-applicable are identified."
              },
              {
                "id": "c-3.12.4_obj.e",
                "name": "objective",
                "prose": "the method of security requirement implementation is described and documented in the system security plan."
              },
              {
                "id": "c-3.12.4_obj.f",
                "name": "objective",
                "prose": "the relationship with or connection to other systems is described and documented in the system security plan."
              },
              {
                "id": "c-3.12.4_obj.g",
                "name": "objective",
                "prose": "the frequency to update the system security plan is defined."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Security planning policy; procedures addressing security plan development and implementation; procedures addressing security plan reviews and updates; enterprise architecture documentation; security plan; records of security plan reviews and updates; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with security planning and plan implementation responsibilities; personnel with information security responsibilities].\n\n**TEST:** [SELECT FROM: Organizational processes for security plan development, review, update, and approval; mechanisms supporting the security plan]."
              }
            ]
          }
        ]
      },
      {
        "id": "c-3.13",
        "title": "System and Communications Protection",
        "class": "family",
        "controls": [
          {
            "id": "c-3.13.1",
            "title": "Monitor, control, and protect communications",
            "parts": [
              {
                "name": "statement",
                "prose": "Monitor, control, and protect communications"
              },
              {
                "id": "c-3.13.1_obj.a",
                "name": "objective",
                "prose": "the external system boundary is defined."
              },
              {
                "id": "c-3.13.1_obj.b",
                "name": "objective",
                "prose": "key internal system boundaries are defined."
              },
              {
                "id": "c-3.13.1_obj.c",
                "name": "objective",
                "prose": "communications are monitored at the external system boundary."
              },
              {
                "id": "c-3.13.1_obj.d",
                "name": "objective",
                "prose": "communications are monitored at key internal boundaries."
              },
              {
                "id": "c-3.13.1_obj.e",
                "name": "objective",
                "prose": "communications are controlled at the external system boundary."
              },
              {
                "id": "c-3.13.1_obj.f",
                "name": "objective",
                "prose": "communications are controlled at key internal boundaries."
              },
              {
                "id": "c-3.13.1_obj.g",
                "name": "objective",
                "prose": "communications are protected at the external system boundary."
              },
              {
                "id": "c-3.13.1_obj.h",
                "name": "objective",
                "prose": "communications are protected at key internal boundaries."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: System and communications protection policy; procedures addressing boundary protection; security plan; list of key internal boundaries of the system; system design documentation; boundary protection hardware and software; enterprise security architecture documentation; system audit logs and records; system configuration settings and associated documentation; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: System or network administrators; personnel with information security responsibilities; system developer; personnel with boundary protection responsibilities].\n\n**TEST:** [SELECT FROM: Mechanisms implementing boundary protection capability]."
              }
            ]
          },
          {
            "id": "c-3.13.2",
            "title": "Employ architectural designs, software development techniques, and systems engineering principles that promote effective information security within organizational systems.",
            "parts": [
              {
                "name": "statement",
                "prose": "Employ architectural designs, software development techniques, and systems engineering principles that promote effective information security within organizational systems."
              },
              {
                "id": "c-3.13.2_obj.a",
                "name": "objective",
                "prose": "architectural designs that promote effective information security are identified."
              },
              {
                "id": "c-3.13.2_obj.b",
                "name": "objective",
                "prose": "software development techniques that promote effective information security are identified."
              },
              {
                "id": "c-3.13.2_obj.c",
                "name": "objective",
                "prose": "systems engineering principles that promote effective information security are identified."
              },
              {
                "id": "c-3.13.2_obj.d",
                "name": "objective",
                "prose": "identified architectural designs that promote effective information security are employed."
              },
              {
                "id": "c-3.13.2_obj.e",
                "name": "objective",
                "prose": "identified software development techniques that promote effective information security are employed."
              },
              {
                "id": "c-3.13.2_obj.f",
                "name": "objective",
                "prose": "identified systems engineering principles that promote effective information security are employed."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Security planning policy; procedures addressing security plan development and implementation; procedures addressing security plan reviews and updates; enterprise architecture documentation; security plan; records of security plan reviews and updates; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with security planning and plan implementation responsibilities; personnel with information security responsibilities].\n\n**TEST:** [SELECT FROM: Organizational processes for security plan development, review, update, and approval; mechanisms supporting the system security plan]."
              }
            ]
          },
          {
            "id": "c-3.13.3",
            "title": "Separate user functionality from system management functionality.",
            "parts": [
              {
                "name": "statement",
                "prose": "Separate user functionality from system management functionality."
              },
              {
                "id": "c-3.13.3_obj.a",
                "name": "objective",
                "prose": "user functionality is identified."
              },
              {
                "id": "c-3.13.3_obj.b",
                "name": "objective",
                "prose": "system management functionality is identified."
              },
              {
                "id": "c-3.13.3_obj.c",
                "name": "objective",
                "prose": "user functionality is separated from system management functionality."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: System and communications protection policy; procedures addressing application partitioning; system design documentation; system configuration settings and associated documentation; security plan; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: System or network administrators; personnel with information security responsibilities; system developer].\n\n**TEST:** [SELECT FROM: Separation of user functionality from system management functionality]."
              }
            ]
          },
          {
            "id": "c-3.13.4",
            "title": "Prevent unauthorized and unintended information transfer via shared system resources.",
            "parts": [
              {
                "name": "statement",
                "prose": "Prevent unauthorized and unintended information transfer via shared system resources."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: System and communications protection policy; procedures addressing application partitioning; security plan; system design documentation; system configuration settings and associated documentation; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: System or network administrators; personnel with information security responsibilities; system developer].\n\n**TEST:** [SELECT FROM: Separation of user functionality from system management functionality]."
              }
            ]
          },
          {
            "id": "c-3.13.5",
            "title": "Implement subnetworks for publicly accessible system components that are physically or logically separated from internal networks.",
            "parts": [
              {
                "name": "statement",
                "prose": "Implement subnetworks for publicly accessible system components that are physically or logically separated from internal networks."
              },
              {
                "id": "c-3.13.5_obj.a",
                "name": "objective",
                "prose": "publicly accessible system components are identified."
              },
              {
                "id": "c-3.13.5_obj.b",
                "name": "objective",
                "prose": "subnetworks for publicly accessible system components are physically or logically separated from internal networks."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: System and communications protection policy; procedures addressing boundary protection; security plan; list of key internal boundaries of the system; system design documentation; boundary protection hardware and software; system configuration settings and associated documentation; enterprise security architecture documentation; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: System or network administrators; personnel with information security responsibilities; system developer; personnel with boundary protection responsibilities].\n\n**TEST:** [SELECT FROM: Mechanisms implementing boundary protection capability]."
              }
            ]
          },
          {
            "id": "c-3.13.6",
            "title": "Deny network communications traffic by default and allow network communications traffic by exception",
            "parts": [
              {
                "name": "statement",
                "prose": "Deny network communications traffic by default and allow network communications traffic by exception"
              },
              {
                "id": "c-3.13.6_obj.a",
                "name": "objective",
                "prose": "network communications traffic is denied by default."
              },
              {
                "id": "c-3.13.6_obj.b",
                "name": "objective",
                "prose": "network communications traffic is allowed by exception."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: System and communications protection policy; procedures addressing boundary protection; security plan; system design documentation; system configuration settings and associated documentation; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: System or network administrators; personnel with information security responsibilities; system developer; personnel with boundary protection responsibilities].\n\n**TEST:** [SELECT FROM: Mechanisms implementing traffic management at managed interfaces]."
              }
            ]
          },
          {
            "id": "c-3.13.7",
            "title": "Prevent remote devices from simultaneously establishing non-remote connections with organizational systems and communicating via some other connection to resources in external networks",
            "parts": [
              {
                "name": "statement",
                "prose": "Prevent remote devices from simultaneously establishing non-remote connections with organizational systems and communicating via some other connection to resources in external networks"
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: System and communications protection policy; procedures addressing boundary protection; security plan; system design documentation; system hardware and software; system architecture; system configuration settings and associated documentation; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: System or network administrators; personnel with information security responsibilities; system developer; personnel with boundary protection responsibilities].\n\n**TEST:** [SELECT FROM: Mechanisms implementing boundary protection capability; mechanisms supporting or restricting non-remote connections]."
              }
            ]
          },
          {
            "id": "c-3.13.8",
            "title": "Implement cryptographic mechanisms to prevent unauthorized disclosure of CUI during transmission unless otherwise protected by alternative physical safeguards.",
            "parts": [
              {
                "name": "statement",
                "prose": "Implement cryptographic mechanisms to prevent unauthorized disclosure of CUI during transmission unless otherwise protected by alternative physical safeguards."
              },
              {
                "id": "c-3.13.8_obj.a",
                "name": "objective",
                "prose": "cryptographic mechanisms intended to prevent unauthorized disclosure of CUI are identified."
              },
              {
                "id": "c-3.13.8_obj.b",
                "name": "objective",
                "prose": "alternative physical safeguards intended to prevent unauthorized disclosure of CUI are identified."
              },
              {
                "id": "c-3.13.8_obj.c",
                "name": "objective",
                "prose": "either cryptographic mechanisms or alternative physical safeguards are implemented to prevent unauthorized disclosure of CUI during transmission."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: System and communications protection policy; procedures addressing transmission confidentiality and integrity; security plan; system design documentation; system configuration settings and associated documentation; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: System or network administrators; personnel with information security responsibilities; system developer].\n\n**TEST:** [SELECT FROM: Cryptographic mechanisms or mechanisms supporting or implementing transmission confidentiality; organizational processes for defining and implementing alternative physical safeguards]."
              }
            ]
          },
          {
            "id": "c-3.13.9",
            "title": "Terminate network connections associated with communications sessions at the end of the sessions or after a defined period of inactivity.",
            "parts": [
              {
                "name": "statement",
                "prose": "Terminate network connections associated with communications sessions at the end of the sessions or after a defined period of inactivity."
              },
              {
                "id": "c-3.13.9_obj.a",
                "name": "objective",
                "prose": "a period of inactivity to terminate network connections associated with communications sessions is defined."
              },
              {
                "id": "c-3.13.9_obj.b",
                "name": "objective",
                "prose": "network connections associated with communications sessions are terminated at the end of the sessions."
              },
              {
                "id": "c-3.13.9_obj.c",
                "name": "objective",
                "prose": "network connections associated with communications sessions are terminated after the defined period of inactivity."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: System and communications protection policy; procedures addressing network disconnect; system design documentation; security plan; system configuration settings and associated documentation; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: System or network administrators; personnel with information security responsibilities; system developer].\n\n**TEST:** [SELECT FROM: Mechanisms supporting or implementing network disconnect capability]."
              }
            ]
          },
          {
            "id": "c-3.13.10",
            "title": "Establish and manage cryptographic keys for cryptography employed in organizational systems.",
            "parts": [
              {
                "name": "statement",
                "prose": "Establish and manage cryptographic keys for cryptography employed in organizational systems."
              },
              {
                "id": "c-3.13.10_obj.a",
                "name": "objective",
                "prose": "cryptographic keys are established whenever cryptography is employed."
              },
              {
                "id": "c-3.13.10_obj.b",
                "name": "objective",
                "prose": "cryptographic keys are managed whenever cryptography is employed."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: System and communications protection policy; procedures addressing cryptographic key establishment and management; security plan; system design documentation; cryptographic mechanisms; system configuration settings and associated documentation; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: System or network administrators; personnel with information security responsibilities; personnel with responsibilities for cryptographic key establishment and management].\n\n**TEST:** [SELECT FROM: Mechanisms supporting or implementing cryptographic key establishment and management]."
              }
            ]
          },
          {
            "id": "c-3.13.11",
            "title": "Employ FIPS-validated cryptography when used to protect the confidentiality of CUI.",
            "parts": [
              {
                "name": "statement",
                "prose": "Employ FIPS-validated cryptography when used to protect the confidentiality of CUI."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: System and communications protection policy; procedures addressing cryptographic protection; security plan; system design documentation; system configuration settings and associated documentation; cryptographic module validation certificates; list of FIPS-validated cryptographic modules; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: System or network administrators; personnel with information security responsibilities; system developer; personnel with responsibilities for cryptographic protection].\n\n**TEST:** [SELECT FROM: Mechanisms supporting or implementing cryptographic protection]."
              }
            ]
          },
          {
            "id": "c-3.13.13",
            "title": "Control and monitor the use of mobile code.",
            "parts": [
              {
                "name": "statement",
                "prose": "Control and monitor the use of mobile code."
              },
              {
                "id": "c-3.13.13_obj.a",
                "name": "objective",
                "prose": "use of mobile code is controlled."
              },
              {
                "id": "c-3.13.13_obj.b",
                "name": "objective",
                "prose": "use of mobile code is monitored."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: System and communications protection policy; procedures addressing mobile code; mobile code usage restrictions, mobile code implementation policy and procedures; security plan; list of acceptable mobile code and mobile code technologies; list of unacceptable mobile code and mobile technologies; authorization records; system monitoring records; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: System or network administrators; personnel with information security responsibilities; personnel with responsibilities for managing mobile code].\n\n**TEST:** [SELECT FROM: Organizational process for controlling, authorizing, monitoring, and restricting mobile code; mechanisms supporting or implementing the management of mobile code; mechanisms supporting or implementing the monitoring of mobile code]."
              }
            ]
          },
          {
            "id": "c-3.13.14",
            "title": "Control and monitor the use of Voice over Internet Protocol",
            "parts": [
              {
                "name": "statement",
                "prose": "Control and monitor the use of Voice over Internet Protocol"
              },
              {
                "id": "c-3.13.14_obj.a",
                "name": "objective",
                "prose": "use of Voice over Internet Protocol (VoIP) technologies is controlled."
              },
              {
                "id": "c-3.13.14_obj.b",
                "name": "objective",
                "prose": "use of Voice over Internet Protocol (VoIP) technologies is monitored."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: System and communications protection policy; procedures addressing VoIP; VoIP usage restrictions; VoIP implementation guidance; security plan; system design documentation; system configuration settings and associated documentation; system monitoring records; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: System or network administrators; personnel with information security responsibilities; personnel with responsibilities for managing VoIP].\n\n**TEST:** [SELECT FROM: Organizational process for authorizing, monitoring, and controlling VoIP; mechanisms supporting or implementing authorizing, monitoring, and controlling VoIP]."
              }
            ]
          },
          {
            "id": "c-3.13.15",
            "title": "Protect the authenticity of communications sessions",
            "parts": [
              {
                "name": "statement",
                "prose": "Protect the authenticity of communications sessions"
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: System and communications protection policy; procedures addressing session authenticity; security plan; system design documentation; system configuration settings and associated documentation; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: System or network administrators; personnel with information security responsibilities].\n\n**TEST:** [SELECT FROM: Mechanisms supporting or implementing session authenticity]."
              }
            ]
          },
          {
            "id": "c-3.13.16",
            "title": "Protect the confidentiality of CUI at rest.",
            "parts": [
              {
                "name": "statement",
                "prose": "Protect the confidentiality of CUI at rest."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: System and communications protection policy; procedures addressing protection of information at rest; security plan; system design documentation; list of information at rest requiring confidentiality protections; system configuration settings and associated documentation; cryptographic mechanisms and associated configuration documentation; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: System or network administrators; personnel with information security responsibilities; system developer].\n\n**TEST:** [SELECT FROM: Mechanisms supporting or implementing confidentiality protections for information at rest]."
              }
            ]
          }
        ]
      },
      {
        "id": "c-3.14",
        "title": "System and Information Integrity",
        "class": "family",
        "controls": [
          {
            "id": "c-3.14.1",
            "title": "Identify, report, and correct system flaws in a timely manner.",
            "parts": [
              {
                "name": "statement",
                "prose": "Identify, report, and correct system flaws in a timely manner."
              },
              {
                "id": "c-3.14.1_obj.a",
                "name": "objective",
                "prose": "the time within which to identify system flaws is specified."
              },
              {
                "id": "c-3.14.1_obj.b",
                "name": "objective",
                "prose": "system flaws are identified within the specified time frame."
              },
              {
                "id": "c-3.14.1_obj.c",
                "name": "objective",
                "prose": "the time within which to report system flaws is specified."
              },
              {
                "id": "c-3.14.1_obj.d",
                "name": "objective",
                "prose": "system flaws are reported within the specified time frame."
              },
              {
                "id": "c-3.14.1_obj.e",
                "name": "objective",
                "prose": "the time within which to correct system flaws is specified."
              },
              {
                "id": "c-3.14.1_obj.f",
                "name": "objective",
                "prose": "system flaws are corrected within the specified time frame."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: System and information integrity policy; procedures addressing flaw remediation; procedures addressing configuration management; security plan; list of flaws and vulnerabilities potentially affecting the system; list of recent security flaw remediation actions performed on the system (e.g., list of installed patches, service packs, hot fixes, and other software updates to correct system flaws); test results from the installation of software and firmware updates to correct system flaws; installation/change control records for security-relevant software and firmware updates; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: System or network administrators; personnel with information security responsibilities; personnel installing, configuring, and maintaining the system; personnel with responsibility for flaw remediation; personnel with configuration management responsibility].\n\n**TEST:** [SELECT FROM: Organizational processes for identifying, reporting, and correcting system flaws; organizational process for installing software and firmware updates; mechanisms supporting or implementing reporting, and correcting system flaws; mechanisms supporting or implementing testing software and firmware updates]."
              }
            ]
          },
          {
            "id": "c-3.14.2",
            "title": "Provide protection from malicious code at designated locations within organizational systems.",
            "parts": [
              {
                "name": "statement",
                "prose": "Provide protection from malicious code at designated locations within organizational systems."
              },
              {
                "id": "c-3.14.2_obj.a",
                "name": "objective",
                "prose": "designated locations for malicious code protection are identified."
              },
              {
                "id": "c-3.14.2_obj.b",
                "name": "objective",
                "prose": "protection from malicious code at designated locations is provided."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: System and information integrity policy; configuration management policy and procedures; procedures addressing malicious code protection; records of malicious code protection updates; malicious code protection mechanisms; security plan; system design documentation; system configuration settings and associated documentation; record of actions initiated by malicious code protection mechanisms in response to malicious code detection; scan results from malicious code protection mechanisms; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: System or network administrators; personnel with information security responsibilities; personnel installing, configuring, and maintaining the system; personnel with responsibility for malicious code protection; personnel with configuration management responsibility].\n\n**TEST:** [SELECT FROM: Organizational processes for employing, updating, and configuring malicious code protection mechanisms; organizational process for addressing false positives and resulting potential impact; mechanisms supporting or implementing employing, updating, and configuring malicious code protection mechanisms; mechanisms supporting or implementing malicious code scanning and subsequent actions]."
              }
            ]
          },
          {
            "id": "c-3.14.3",
            "title": "Monitor system security alerts and advisories and take action in response.",
            "parts": [
              {
                "name": "statement",
                "prose": "Monitor system security alerts and advisories and take action in response."
              },
              {
                "id": "c-3.14.3_obj.a",
                "name": "objective",
                "prose": "response actions to system security alerts and advisories are identified."
              },
              {
                "id": "c-3.14.3_obj.b",
                "name": "objective",
                "prose": "system security alerts and advisories are monitored."
              },
              {
                "id": "c-3.14.3_obj.c",
                "name": "objective",
                "prose": "actions in response to system security alerts and advisories are taken."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: System and information integrity policy; procedures addressing security alerts, advisories, and directives; security plan; records of security alerts and advisories; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: Personnel with security alert and advisory responsibilities; personnel implementing, operating, maintaining, and using the system; personnel, organizational elements, and external organizations to whom alerts, advisories, and directives are to be disseminated; system or network administrators; personnel with information security responsibilities].\n\n**TEST:** [SELECT FROM: Organizational processes for defining, receiving, generating, disseminating, and complying with security alerts, advisories, and directives; mechanisms supporting or implementing definition, receipt, generation, and dissemination of security alerts, advisories, and directives; mechanisms supporting or implementing security directives]."
              }
            ]
          },
          {
            "id": "c-3.14.4",
            "title": "Update malicious code protection mechanisms when new releases are available.",
            "parts": [
              {
                "name": "statement",
                "prose": "Update malicious code protection mechanisms when new releases are available."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: System and information integrity policy; configuration management policy and procedures; procedures addressing malicious code protection; malicious code protection mechanisms; records of malicious code protection updates; security plan; system design documentation; system configuration settings and associated documentation; scan results from malicious code protection mechanisms; record of actions initiated by malicious code protection mechanisms in response to malicious code detection; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: System or network administrators; personnel with information security responsibilities; personnel installing, configuring, and maintaining the system; personnel with responsibility for malicious code protection; personnel with configuration management responsibility].\n\n**TEST:** [SELECT FROM: Organizational processes for employing, updating, and configuring malicious code protection mechanisms; organizational process for addressing false positives and resulting potential impact; mechanisms supporting or implementing malicious code protection mechanisms (including updates and configurations); mechanisms supporting or implementing malicious code scanning and subsequent actions]."
              }
            ]
          },
          {
            "id": "c-3.14.5",
            "title": "Perform periodic scans of organizational systems and real-time scans of files from external sources as files are downloaded, opened, or executed.",
            "parts": [
              {
                "name": "statement",
                "prose": "Perform periodic scans of organizational systems and real-time scans of files from external sources as files are downloaded, opened, or executed."
              },
              {
                "id": "c-3.14.5_obj.a",
                "name": "objective",
                "prose": "the frequency for malicious code scans is defined."
              },
              {
                "id": "c-3.14.5_obj.b",
                "name": "objective",
                "prose": "malicious code scans are performed with the defined frequency."
              },
              {
                "id": "c-3.14.5_obj.c",
                "name": "objective",
                "prose": "real-time malicious code scans of files from external sources as files are downloaded, opened, or executed are performed."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: System and information integrity policy; configuration management policy and procedures; procedures addressing malicious code protection; malicious code protection mechanisms; records of malicious code protection updates; security plan; system design documentation; system configuration settings and associated documentation; scan results from malicious code protection mechanisms; record of actions initiated by malicious code protection mechanisms in response to malicious code detection; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: System or network administrators; personnel with information security responsibilities; personnel installing, configuring, and maintaining the system; personnel with responsibility for malicious code protection; personnel with configuration management responsibility].\n\n**TEST:** [SELECT FROM: Organizational processes for employing, updating, and configuring malicious code protection mechanisms; organizational process for addressing false positives and resulting potential impact; mechanisms supporting or implementing malicious code protection mechanisms (including updates and configurations); mechanisms supporting or implementing malicious code scanning and subsequent actions]."
              }
            ]
          },
          {
            "id": "c-3.14.6",
            "title": "Monitor organizational systems, including inbound and outbound communications traffic, to detect attacks and indicators of potential attacks",
            "parts": [
              {
                "name": "statement",
                "prose": "Monitor organizational systems, including inbound and outbound communications traffic, to detect attacks and indicators of potential attacks"
              },
              {
                "id": "c-3.14.6_obj.a",
                "name": "objective",
                "prose": "the system is monitored to detect attacks and indicators of potential attacks."
              },
              {
                "id": "c-3.14.6_obj.b",
                "name": "objective",
                "prose": "inbound communications traffic is monitored to detect attacks and indicators of potential attacks."
              },
              {
                "id": "c-3.14.6_obj.c",
                "name": "objective",
                "prose": "outbound communications traffic is monitored to detect attacks and indicators of potential attacks."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: System and information integrity policy; procedures addressing system monitoring tools and techniques; continuous monitoring strategy; system and information integrity policy; procedures addressing system monitoring tools and techniques; facility diagram or layout; security plan; system design documentation; system monitoring tools and techniques documentation; locations within system where monitoring devices are deployed; system protocols; system configuration settings and associated documentation; system audit logs and records; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: System or network administrators; personnel with information security responsibilities; personnel installing, configuring, and maintaining the system; personnel with responsibility monitoring the system; personnel with responsibility for the intrusion detection system].\n\n**TEST:** [SELECT FROM: Organizational processes for system monitoring; mechanisms supporting or implementing intrusion detection capability and system monitoring; mechanisms supporting or implementing system monitoring capability; organizational processes for intrusion detection and system monitoring; mechanisms supporting or implementing the monitoring of inbound and outbound communications traffic]."
              }
            ]
          },
          {
            "id": "c-3.14.7",
            "title": "Identify unauthorized use of organizational systems.",
            "parts": [
              {
                "name": "statement",
                "prose": "Identify unauthorized use of organizational systems."
              },
              {
                "id": "c-3.14.7_obj.a",
                "name": "objective",
                "prose": "authorized use of the system is defined."
              },
              {
                "id": "c-3.14.7_obj.b",
                "name": "objective",
                "prose": "unauthorized use of the system is identified."
              },
              {
                "name": "guidance",
                "prose": "**EXAMINE:** [SELECT FROM: Continuous monitoring strategy; system and information integrity policy; procedures addressing system monitoring tools and techniques; facility diagram/layout; security plan; system design documentation; system monitoring tools and techniques documentation; locations within system where monitoring devices are deployed; system configuration settings and associated documentation; other relevant documents or records].\n\n**INTERVIEW:** [SELECT FROM: System or network administrators; personnel with information security responsibilities; personnel installing, configuring, and maintaining the system; personnel with responsibility for monitoring the system].\n\n**TEST:** [SELECT FROM: Organizational processes for system monitoring; mechanisms supporting or implementing system monitoring capability]."
              }
            ]
          }
        ]
      }
    ]
  }
}